GD32-MCU-IOT/hal_gigadevice_zephyr/include/dt-bindings/pinctrl/gd32h759i(g-i-m)xx-pinctrl.h
/*
 * Autogenerated file
 *
 * SPDX-License-Identifier: Apache 2.0
 */

#include "gd32-af.h"

/* ADC012_IN10 */
#define ADC012_IN10_PC0 \
	GD32_PINMUX_AF('C', 0, ANALOG)

/* ADC012_IN11 */
#define ADC012_IN11_PC1 \
	GD32_PINMUX_AF('C', 1, ANALOG)

/* ADC012_IN12 */
#define ADC012_IN12_PC2 \
	GD32_PINMUX_AF('C', 2, ANALOG)

/* ADC01_IN13 */
#define ADC01_IN13_PC3 \
	GD32_PINMUX_AF('C', 3, ANALOG)

/* ADC01_IN14 */
#define ADC01_IN14_PA2 \
	GD32_PINMUX_AF('A', 2, ANALOG)

/* ADC01_IN15 */
#define ADC01_IN15_PA3 \
	GD32_PINMUX_AF('A', 3, ANALOG)

/* ADC01_IN18 */
#define ADC01_IN18_PA4 \
	GD32_PINMUX_AF('A', 4, ANALOG)

/* ADC01_IN19 */
#define ADC01_IN19_PA5 \
	GD32_PINMUX_AF('A', 5, ANALOG)

/* ADC01_IN3 */
#define ADC01_IN3_PA6 \
	GD32_PINMUX_AF('A', 6, ANALOG)

/* ADC01_IN4 */
#define ADC01_IN4_PC4 \
	GD32_PINMUX_AF('C', 4, ANALOG)

/* ADC01_IN5 */
#define ADC01_IN5_PB1 \
	GD32_PINMUX_AF('B', 1, ANALOG)

/* ADC01_IN7 */
#define ADC01_IN7_PA7 \
	GD32_PINMUX_AF('A', 7, ANALOG)

/* ADC01_IN8 */
#define ADC01_IN8_PC5 \
	GD32_PINMUX_AF('C', 5, ANALOG)

/* ADC01_IN9 */
#define ADC01_IN9_PB0 \
	GD32_PINMUX_AF('B', 0, ANALOG)

/* ADC0_IN16 */
#define ADC0_IN16_PA0 \
	GD32_PINMUX_AF('A', 0, ANALOG)

/* ADC0_IN17 */
#define ADC0_IN17_PA1 \
	GD32_PINMUX_AF('A', 1, ANALOG)

/* ADC0_IN2 */
#define ADC0_IN2_PF11 \
	GD32_PINMUX_AF('F', 11, ANALOG)

/* ADC0_IN6 */
#define ADC0_IN6_PF12 \
	GD32_PINMUX_AF('F', 12, ANALOG)

/* ADC1_IN2 */
#define ADC1_IN2_PF13 \
	GD32_PINMUX_AF('F', 13, ANALOG)

/* ADC1_IN6 */
#define ADC1_IN6_PF14 \
	GD32_PINMUX_AF('F', 14, ANALOG)

/* ADC2_IN13 */
#define ADC2_IN13_PH2 \
	GD32_PINMUX_AF('H', 2, ANALOG)

/* ADC2_IN14 */
#define ADC2_IN14_PH3 \
	GD32_PINMUX_AF('H', 3, ANALOG)

/* ADC2_IN15 */
#define ADC2_IN15_PH4 \
	GD32_PINMUX_AF('H', 4, ANALOG)

/* ADC2_IN16 */
#define ADC2_IN16_PH5 \
	GD32_PINMUX_AF('H', 5, ANALOG)

/* ADC2_IN2 */
#define ADC2_IN2_PF9 \
	GD32_PINMUX_AF('F', 9, ANALOG)

/* ADC2_IN3 */
#define ADC2_IN3_PF7 \
	GD32_PINMUX_AF('F', 7, ANALOG)

/* ADC2_IN4 */
#define ADC2_IN4_PF5 \
	GD32_PINMUX_AF('F', 5, ANALOG)

/* ADC2_IN5 */
#define ADC2_IN5_PF3 \
	GD32_PINMUX_AF('F', 3, ANALOG)

/* ADC2_IN6 */
#define ADC2_IN6_PF10 \
	GD32_PINMUX_AF('F', 10, ANALOG)

/* ADC2_IN7 */
#define ADC2_IN7_PF8 \
	GD32_PINMUX_AF('F', 8, ANALOG)

/* ADC2_IN8 */
#define ADC2_IN8_PF6 \
	GD32_PINMUX_AF('F', 6, ANALOG)

/* ADC2_IN9 */
#define ADC2_IN9_PF4 \
	GD32_PINMUX_AF('F', 4, ANALOG)

/* ANALOG */
#define ANALOG_PA0 \
	GD32_PINMUX_AF('A', 0, ANALOG)
#define ANALOG_PA1 \
	GD32_PINMUX_AF('A', 1, ANALOG)
#define ANALOG_PA2 \
	GD32_PINMUX_AF('A', 2, ANALOG)
#define ANALOG_PA3 \
	GD32_PINMUX_AF('A', 3, ANALOG)
#define ANALOG_PA4 \
	GD32_PINMUX_AF('A', 4, ANALOG)
#define ANALOG_PA5 \
	GD32_PINMUX_AF('A', 5, ANALOG)
#define ANALOG_PA6 \
	GD32_PINMUX_AF('A', 6, ANALOG)
#define ANALOG_PA7 \
	GD32_PINMUX_AF('A', 7, ANALOG)
#define ANALOG_PA8 \
	GD32_PINMUX_AF('A', 8, ANALOG)
#define ANALOG_PA9 \
	GD32_PINMUX_AF('A', 9, ANALOG)
#define ANALOG_PA10 \
	GD32_PINMUX_AF('A', 10, ANALOG)
#define ANALOG_PA13 \
	GD32_PINMUX_AF('A', 13, ANALOG)
#define ANALOG_PA14 \
	GD32_PINMUX_AF('A', 14, ANALOG)
#define ANALOG_PA15 \
	GD32_PINMUX_AF('A', 15, ANALOG)
#define ANALOG_PB0 \
	GD32_PINMUX_AF('B', 0, ANALOG)
#define ANALOG_PB1 \
	GD32_PINMUX_AF('B', 1, ANALOG)
#define ANALOG_PB2 \
	GD32_PINMUX_AF('B', 2, ANALOG)
#define ANALOG_PB3 \
	GD32_PINMUX_AF('B', 3, ANALOG)
#define ANALOG_PB4 \
	GD32_PINMUX_AF('B', 4, ANALOG)
#define ANALOG_PB5 \
	GD32_PINMUX_AF('B', 5, ANALOG)
#define ANALOG_PB6 \
	GD32_PINMUX_AF('B', 6, ANALOG)
#define ANALOG_PB7 \
	GD32_PINMUX_AF('B', 7, ANALOG)
#define ANALOG_PB8 \
	GD32_PINMUX_AF('B', 8, ANALOG)
#define ANALOG_PB9 \
	GD32_PINMUX_AF('B', 9, ANALOG)
#define ANALOG_PB10 \
	GD32_PINMUX_AF('B', 10, ANALOG)
#define ANALOG_PB11 \
	GD32_PINMUX_AF('B', 11, ANALOG)
#define ANALOG_PB12 \
	GD32_PINMUX_AF('B', 12, ANALOG)
#define ANALOG_PB13 \
	GD32_PINMUX_AF('B', 13, ANALOG)
#define ANALOG_PC0 \
	GD32_PINMUX_AF('C', 0, ANALOG)
#define ANALOG_PC1 \
	GD32_PINMUX_AF('C', 1, ANALOG)
#define ANALOG_PC2 \
	GD32_PINMUX_AF('C', 2, ANALOG)
#define ANALOG_PC3 \
	GD32_PINMUX_AF('C', 3, ANALOG)
#define ANALOG_PC4 \
	GD32_PINMUX_AF('C', 4, ANALOG)
#define ANALOG_PC5 \
	GD32_PINMUX_AF('C', 5, ANALOG)
#define ANALOG_PC6 \
	GD32_PINMUX_AF('C', 6, ANALOG)
#define ANALOG_PC7 \
	GD32_PINMUX_AF('C', 7, ANALOG)
#define ANALOG_PC8 \
	GD32_PINMUX_AF('C', 8, ANALOG)
#define ANALOG_PC9 \
	GD32_PINMUX_AF('C', 9, ANALOG)
#define ANALOG_PC10 \
	GD32_PINMUX_AF('C', 10, ANALOG)
#define ANALOG_PC11 \
	GD32_PINMUX_AF('C', 11, ANALOG)
#define ANALOG_PC12 \
	GD32_PINMUX_AF('C', 12, ANALOG)
#define ANALOG_PC13 \
	GD32_PINMUX_AF('C', 13, ANALOG)
#define ANALOG_PC14 \
	GD32_PINMUX_AF('C', 14, ANALOG)
#define ANALOG_PC15 \
	GD32_PINMUX_AF('C', 15, ANALOG)
#define ANALOG_PD0 \
	GD32_PINMUX_AF('D', 0, ANALOG)
#define ANALOG_PD1 \
	GD32_PINMUX_AF('D', 1, ANALOG)
#define ANALOG_PD2 \
	GD32_PINMUX_AF('D', 2, ANALOG)
#define ANALOG_PD3 \
	GD32_PINMUX_AF('D', 3, ANALOG)
#define ANALOG_PD4 \
	GD32_PINMUX_AF('D', 4, ANALOG)
#define ANALOG_PD5 \
	GD32_PINMUX_AF('D', 5, ANALOG)
#define ANALOG_PD6 \
	GD32_PINMUX_AF('D', 6, ANALOG)
#define ANALOG_PD7 \
	GD32_PINMUX_AF('D', 7, ANALOG)
#define ANALOG_PD8 \
	GD32_PINMUX_AF('D', 8, ANALOG)
#define ANALOG_PD9 \
	GD32_PINMUX_AF('D', 9, ANALOG)
#define ANALOG_PD10 \
	GD32_PINMUX_AF('D', 10, ANALOG)
#define ANALOG_PD11 \
	GD32_PINMUX_AF('D', 11, ANALOG)
#define ANALOG_PD12 \
	GD32_PINMUX_AF('D', 12, ANALOG)
#define ANALOG_PD13 \
	GD32_PINMUX_AF('D', 13, ANALOG)
#define ANALOG_PD14 \
	GD32_PINMUX_AF('D', 14, ANALOG)
#define ANALOG_PD15 \
	GD32_PINMUX_AF('D', 15, ANALOG)
#define ANALOG_PE0 \
	GD32_PINMUX_AF('E', 0, ANALOG)
#define ANALOG_PE1 \
	GD32_PINMUX_AF('E', 1, ANALOG)
#define ANALOG_PE2 \
	GD32_PINMUX_AF('E', 2, ANALOG)
#define ANALOG_PE3 \
	GD32_PINMUX_AF('E', 3, ANALOG)
#define ANALOG_PE4 \
	GD32_PINMUX_AF('E', 4, ANALOG)
#define ANALOG_PE5 \
	GD32_PINMUX_AF('E', 5, ANALOG)
#define ANALOG_PE6 \
	GD32_PINMUX_AF('E', 6, ANALOG)
#define ANALOG_PE7 \
	GD32_PINMUX_AF('E', 7, ANALOG)
#define ANALOG_PE8 \
	GD32_PINMUX_AF('E', 8, ANALOG)
#define ANALOG_PE9 \
	GD32_PINMUX_AF('E', 9, ANALOG)
#define ANALOG_PE10 \
	GD32_PINMUX_AF('E', 10, ANALOG)
#define ANALOG_PE11 \
	GD32_PINMUX_AF('E', 11, ANALOG)
#define ANALOG_PE12 \
	GD32_PINMUX_AF('E', 12, ANALOG)
#define ANALOG_PE13 \
	GD32_PINMUX_AF('E', 13, ANALOG)
#define ANALOG_PE14 \
	GD32_PINMUX_AF('E', 14, ANALOG)
#define ANALOG_PE15 \
	GD32_PINMUX_AF('E', 15, ANALOG)
#define ANALOG_PF0 \
	GD32_PINMUX_AF('F', 0, ANALOG)
#define ANALOG_PF1 \
	GD32_PINMUX_AF('F', 1, ANALOG)
#define ANALOG_PF2 \
	GD32_PINMUX_AF('F', 2, ANALOG)
#define ANALOG_PF3 \
	GD32_PINMUX_AF('F', 3, ANALOG)
#define ANALOG_PF4 \
	GD32_PINMUX_AF('F', 4, ANALOG)
#define ANALOG_PF5 \
	GD32_PINMUX_AF('F', 5, ANALOG)
#define ANALOG_PF6 \
	GD32_PINMUX_AF('F', 6, ANALOG)
#define ANALOG_PF7 \
	GD32_PINMUX_AF('F', 7, ANALOG)
#define ANALOG_PF8 \
	GD32_PINMUX_AF('F', 8, ANALOG)
#define ANALOG_PF9 \
	GD32_PINMUX_AF('F', 9, ANALOG)
#define ANALOG_PF10 \
	GD32_PINMUX_AF('F', 10, ANALOG)
#define ANALOG_PF11 \
	GD32_PINMUX_AF('F', 11, ANALOG)
#define ANALOG_PF12 \
	GD32_PINMUX_AF('F', 12, ANALOG)
#define ANALOG_PF13 \
	GD32_PINMUX_AF('F', 13, ANALOG)
#define ANALOG_PF14 \
	GD32_PINMUX_AF('F', 14, ANALOG)
#define ANALOG_PF15 \
	GD32_PINMUX_AF('F', 15, ANALOG)
#define ANALOG_PG0 \
	GD32_PINMUX_AF('G', 0, ANALOG)
#define ANALOG_PG1 \
	GD32_PINMUX_AF('G', 1, ANALOG)
#define ANALOG_PG2 \
	GD32_PINMUX_AF('G', 2, ANALOG)
#define ANALOG_PG3 \
	GD32_PINMUX_AF('G', 3, ANALOG)
#define ANALOG_PG4 \
	GD32_PINMUX_AF('G', 4, ANALOG)
#define ANALOG_PG5 \
	GD32_PINMUX_AF('G', 5, ANALOG)
#define ANALOG_PG6 \
	GD32_PINMUX_AF('G', 6, ANALOG)
#define ANALOG_PG7 \
	GD32_PINMUX_AF('G', 7, ANALOG)
#define ANALOG_PG8 \
	GD32_PINMUX_AF('G', 8, ANALOG)
#define ANALOG_PG9 \
	GD32_PINMUX_AF('G', 9, ANALOG)
#define ANALOG_PG10 \
	GD32_PINMUX_AF('G', 10, ANALOG)
#define ANALOG_PG11 \
	GD32_PINMUX_AF('G', 11, ANALOG)
#define ANALOG_PG12 \
	GD32_PINMUX_AF('G', 12, ANALOG)
#define ANALOG_PG13 \
	GD32_PINMUX_AF('G', 13, ANALOG)
#define ANALOG_PG14 \
	GD32_PINMUX_AF('G', 14, ANALOG)
#define ANALOG_PG15 \
	GD32_PINMUX_AF('G', 15, ANALOG)
#define ANALOG_PH0 \
	GD32_PINMUX_AF('H', 0, ANALOG)
#define ANALOG_PH1 \
	GD32_PINMUX_AF('H', 1, ANALOG)
#define ANALOG_PH2 \
	GD32_PINMUX_AF('H', 2, ANALOG)
#define ANALOG_PH3 \
	GD32_PINMUX_AF('H', 3, ANALOG)
#define ANALOG_PH4 \
	GD32_PINMUX_AF('H', 4, ANALOG)
#define ANALOG_PH5 \
	GD32_PINMUX_AF('H', 5, ANALOG)
#define ANALOG_PH6 \
	GD32_PINMUX_AF('H', 6, ANALOG)
#define ANALOG_PH7 \
	GD32_PINMUX_AF('H', 7, ANALOG)
#define ANALOG_PH8 \
	GD32_PINMUX_AF('H', 8, ANALOG)
#define ANALOG_PH9 \
	GD32_PINMUX_AF('H', 9, ANALOG)
#define ANALOG_PH10 \
	GD32_PINMUX_AF('H', 10, ANALOG)
#define ANALOG_PH11 \
	GD32_PINMUX_AF('H', 11, ANALOG)
#define ANALOG_PH12 \
	GD32_PINMUX_AF('H', 12, ANALOG)
#define ANALOG_PH13 \
	GD32_PINMUX_AF('H', 13, ANALOG)
#define ANALOG_PH14 \
	GD32_PINMUX_AF('H', 14, ANALOG)
#define ANALOG_PH15 \
	GD32_PINMUX_AF('H', 15, ANALOG)
#define ANALOG_PJ8 \
	GD32_PINMUX_AF('J', 8, ANALOG)
#define ANALOG_PJ9 \
	GD32_PINMUX_AF('J', 9, ANALOG)
#define ANALOG_PJ10 \
	GD32_PINMUX_AF('J', 10, ANALOG)
#define ANALOG_PJ11 \
	GD32_PINMUX_AF('J', 11, ANALOG)
#define ANALOG_PK0 \
	GD32_PINMUX_AF('K', 0, ANALOG)
#define ANALOG_PK1 \
	GD32_PINMUX_AF('K', 1, ANALOG)
#define ANALOG_PK2 \
	GD32_PINMUX_AF('K', 2, ANALOG)

/* CAN0_RX */
#define CAN0_RX_PA13 \
	GD32_PINMUX_AF('A', 13, AF9)
#define CAN0_RX_PB8 \
	GD32_PINMUX_AF('B', 8, AF9)
#define CAN0_RX_PD0 \
	GD32_PINMUX_AF('D', 0, AF9)
#define CAN0_RX_PH14 \
	GD32_PINMUX_AF('H', 14, AF9)

/* CAN0_TX */
#define CAN0_TX_PA14 \
	GD32_PINMUX_AF('A', 14, AF9)
#define CAN0_TX_PB9 \
	GD32_PINMUX_AF('B', 9, AF9)
#define CAN0_TX_PD1 \
	GD32_PINMUX_AF('D', 1, AF9)
#define CAN0_TX_PH13 \
	GD32_PINMUX_AF('H', 13, AF9)

/* CAN1_RX */
#define CAN1_RX_PB5 \
	GD32_PINMUX_AF('B', 5, AF9)
#define CAN1_RX_PB12 \
	GD32_PINMUX_AF('B', 12, AF9)

/* CAN1_TX */
#define CAN1_TX_PB6 \
	GD32_PINMUX_AF('B', 6, AF9)
#define CAN1_TX_PB13 \
	GD32_PINMUX_AF('B', 13, AF9)

/* CAN2_RX */
#define CAN2_RX_PD12 \
	GD32_PINMUX_AF('D', 12, AF5)
#define CAN2_RX_PF6 \
	GD32_PINMUX_AF('F', 6, AF2)
#define CAN2_RX_PG10 \
	GD32_PINMUX_AF('G', 10, AF2)

/* CAN2_TX */
#define CAN2_TX_PD13 \
	GD32_PINMUX_AF('D', 13, AF5)
#define CAN2_TX_PF7 \
	GD32_PINMUX_AF('F', 7, AF2)
#define CAN2_TX_PG9 \
	GD32_PINMUX_AF('G', 9, AF2)

