GD32-MCU-IOT/hal_gigadevice_zephyr/include/dt-bindings/pinctrl/gd32h759i(g-i-m)xx-pinctrl.h
/* CK_OUT0 */
#define CK_OUT0_PA8 \
	GD32_PINMUX_AF('A', 8, AF0)

/* CK_OUT1 */
#define CK_OUT1_PC9 \
	GD32_PINMUX_AF('C', 9, AF0)

/* CMP0_OUT */
#define CMP0_OUT_PC5 \
	GD32_PINMUX_AF('C', 5, AF13)
#define CMP0_OUT_PE12 \
	GD32_PINMUX_AF('E', 12, AF13)

/* CMP1_OUT */
#define CMP1_OUT_PE8 \
	GD32_PINMUX_AF('E', 8, AF13)
#define CMP1_OUT_PE13 \
	GD32_PINMUX_AF('E', 13, AF13)

/* CMP_MUX_OUT0 */
#define CMP_MUX_OUT0_PA6 \
	GD32_PINMUX_AF('A', 6, AF10)

/* CMP_MUX_OUT1 */
#define CMP_MUX_OUT1_PA8 \
	GD32_PINMUX_AF('A', 8, AF12)

/* CMP_MUX_OUT10 */
#define CMP_MUX_OUT10_PK2 \
	GD32_PINMUX_AF('K', 2, AF10)

/* CMP_MUX_OUT2 */
#define CMP_MUX_OUT2_PB12 \
	GD32_PINMUX_AF('B', 12, AF13)

/* CMP_MUX_OUT3 */
#define CMP_MUX_OUT3_PE6 \
	GD32_PINMUX_AF('E', 6, AF11)

/* CMP_MUX_OUT4 */
#define CMP_MUX_OUT4_PE15 \
	GD32_PINMUX_AF('E', 15, AF13)

/* CMP_MUX_OUT5 */
#define CMP_MUX_OUT5_PG2 \
	GD32_PINMUX_AF('G', 2, AF11)

/* CMP_MUX_OUT6 */
#define CMP_MUX_OUT6_PG3 \
	GD32_PINMUX_AF('G', 3, AF11)

/* CMP_MUX_OUT7 */
#define CMP_MUX_OUT7_PG4 \
	GD32_PINMUX_AF('G', 4, AF11)

/* CMP_MUX_OUT8 */
#define CMP_MUX_OUT8_PK0 \
	GD32_PINMUX_AF('K', 0, AF11)

/* CMP_MUX_OUT9 */
#define CMP_MUX_OUT9_PK1 \
	GD32_PINMUX_AF('K', 1, AF11)

/* CTC_SYNC */
#define CTC_SYNC_PB3 \
	GD32_PINMUX_AF('B', 3, AF10)

/* DAC0_OUT0 */
#define DAC0_OUT0_PA4 \
	GD32_PINMUX_AF('A', 4, ANALOG)

/* DAC0_OUT1 */
#define DAC0_OUT1_PA5 \
	GD32_PINMUX_AF('A', 5, ANALOG)

/* DCI_D0 */
#define DCI_D0_PA9 \
	GD32_PINMUX_AF('A', 9, AF13)
#define DCI_D0_PC6 \
	GD32_PINMUX_AF('C', 6, AF13)
#define DCI_D0_PH9 \
	GD32_PINMUX_AF('H', 9, AF13)

/* DCI_D1 */
#define DCI_D1_PA10 \
	GD32_PINMUX_AF('A', 10, AF13)
#define DCI_D1_PC7 \
	GD32_PINMUX_AF('C', 7, AF13)
#define DCI_D1_PH10 \
	GD32_PINMUX_AF('H', 10, AF13)

/* DCI_D10 */
#define DCI_D10_PB5 \
	GD32_PINMUX_AF('B', 5, AF13)
#define DCI_D10_PD6 \
	GD32_PINMUX_AF('D', 6, AF13)

/* DCI_D11 */
#define DCI_D11_PD2 \
	GD32_PINMUX_AF('D', 2, AF13)
#define DCI_D11_PF10 \
	GD32_PINMUX_AF('F', 10, AF13)
#define DCI_D11_PH15 \
	GD32_PINMUX_AF('H', 15, AF13)

/* DCI_D12 */
#define DCI_D12_PD12 \
	GD32_PINMUX_AF('D', 12, AF13)
#define DCI_D12_PF11 \
	GD32_PINMUX_AF('F', 11, AF13)
#define DCI_D12_PG6 \
	GD32_PINMUX_AF('G', 6, AF13)

/* DCI_D13 */
#define DCI_D13_PD13 \
	GD32_PINMUX_AF('D', 13, AF13)
#define DCI_D13_PG7 \
	GD32_PINMUX_AF('G', 7, AF13)
#define DCI_D13_PG15 \
	GD32_PINMUX_AF('G', 15, AF13)

/* DCI_D2 */
#define DCI_D2_PB13 \
	GD32_PINMUX_AF('B', 13, AF13)
#define DCI_D2_PC8 \
	GD32_PINMUX_AF('C', 8, AF13)
#define DCI_D2_PE0 \
	GD32_PINMUX_AF('E', 0, AF13)
#define DCI_D2_PG10 \
	GD32_PINMUX_AF('G', 10, AF13)
#define DCI_D2_PH11 \
	GD32_PINMUX_AF('H', 11, AF13)

/* DCI_D3 */
#define DCI_D3_PC9 \
	GD32_PINMUX_AF('C', 9, AF13)
#define DCI_D3_PE1 \
	GD32_PINMUX_AF('E', 1, AF13)
#define DCI_D3_PG11 \
	GD32_PINMUX_AF('G', 11, AF13)
#define DCI_D3_PH12 \
	GD32_PINMUX_AF('H', 12, AF13)

/* DCI_D4 */
#define DCI_D4_PC11 \
	GD32_PINMUX_AF('C', 11, AF13)
#define DCI_D4_PE4 \
	GD32_PINMUX_AF('E', 4, AF13)
#define DCI_D4_PH14 \
	GD32_PINMUX_AF('H', 14, AF13)

/* DCI_D5 */
#define DCI_D5_PB6 \
	GD32_PINMUX_AF('B', 6, AF13)
#define DCI_D5_PD3 \
	GD32_PINMUX_AF('D', 3, AF13)

/* DCI_D6 */
#define DCI_D6_PB8 \
	GD32_PINMUX_AF('B', 8, AF13)
#define DCI_D6_PE5 \
	GD32_PINMUX_AF('E', 5, AF13)

/* DCI_D7 */
#define DCI_D7_PB9 \
	GD32_PINMUX_AF('B', 9, AF13)
#define DCI_D7_PE6 \
	GD32_PINMUX_AF('E', 6, AF13)

/* DCI_D8 */
#define DCI_D8_PC10 \
	GD32_PINMUX_AF('C', 10, AF13)
#define DCI_D8_PH6 \
	GD32_PINMUX_AF('H', 6, AF13)

/* DCI_D9 */
#define DCI_D9_PC12 \
	GD32_PINMUX_AF('C', 12, AF13)
#define DCI_D9_PH7 \
	GD32_PINMUX_AF('H', 7, AF13)

/* DCI_HSYNC */
#define DCI_HSYNC_PA4 \
	GD32_PINMUX_AF('A', 4, AF13)
#define DCI_HSYNC_PH8 \
	GD32_PINMUX_AF('H', 8, AF13)

/* DCI_PIXCLK */
#define DCI_PIXCLK_PA6 \
	GD32_PINMUX_AF('A', 6, AF13)
#define DCI_PIXCLK_PE3 \
	GD32_PINMUX_AF('E', 3, AF13)

/* DCI_VSYNC */
#define DCI_VSYNC_PB7 \
	GD32_PINMUX_AF('B', 7, AF13)
#define DCI_VSYNC_PG9 \
	GD32_PINMUX_AF('G', 9, AF13)

/* EDOUT_A */
#define EDOUT_A_PD12 \
	GD32_PINMUX_AF('D', 12, AF6)
#define EDOUT_A_PH7 \
	GD32_PINMUX_AF('H', 7, AF3)

/* EDOUT_B */
#define EDOUT_B_PD13 \
	GD32_PINMUX_AF('D', 13, AF6)
#define EDOUT_B_PH8 \
	GD32_PINMUX_AF('H', 8, AF3)

/* EDOUT_Z */
#define EDOUT_Z_PD14 \
	GD32_PINMUX_AF('D', 14, AF6)
#define EDOUT_Z_PH9 \
	GD32_PINMUX_AF('H', 9, AF3)

/* ETH0_MDC */
#define ETH0_MDC_PC1 \
	GD32_PINMUX_AF('C', 1, AF11)

/* ETH0_MDIO */
#define ETH0_MDIO_PA2 \
	GD32_PINMUX_AF('A', 2, AF11)

/* ETH0_MII_COL */
#define ETH0_MII_COL_PA3 \
	GD32_PINMUX_AF('A', 3, AF11)
#define ETH0_MII_COL_PH3 \
	GD32_PINMUX_AF('H', 3, AF11)

/* ETH0_MII_CRS */
#define ETH0_MII_CRS_PA0 \
	GD32_PINMUX_AF('A', 0, AF11)
#define ETH0_MII_CRS_PH2 \
	GD32_PINMUX_AF('H', 2, AF11)

/* ETH0_MII_RXD0 */
#define ETH0_MII_RXD0_PC4 \
	GD32_PINMUX_AF('C', 4, AF11)

/* ETH0_MII_RXD1 */
#define ETH0_MII_RXD1_PC5 \
	GD32_PINMUX_AF('C', 5, AF11)

/* ETH0_MII_RXD2 */
#define ETH0_MII_RXD2_PB0 \
	GD32_PINMUX_AF('B', 0, AF11)
#define ETH0_MII_RXD2_PH6 \
	GD32_PINMUX_AF('H', 6, AF11)

/* ETH0_MII_RXD3 */
#define ETH0_MII_RXD3_PB1 \
	GD32_PINMUX_AF('B', 1, AF11)
#define ETH0_MII_RXD3_PH7 \
	GD32_PINMUX_AF('H', 7, AF11)

/* ETH0_MII_RX_CLK */
#define ETH0_MII_RX_CLK_PA1 \
	GD32_PINMUX_AF('A', 1, AF11)

/* ETH0_MII_RX_DV */
#define ETH0_MII_RX_DV_PA7 \
	GD32_PINMUX_AF('A', 7, AF11)

/* ETH0_MII_RX_ER */
#define ETH0_MII_RX_ER_PB10 \
	GD32_PINMUX_AF('B', 10, AF11)

/* ETH0_MII_TXD0 */
#define ETH0_MII_TXD0_PB12 \
	GD32_PINMUX_AF('B', 12, AF11)
#define ETH0_MII_TXD0_PG13 \
	GD32_PINMUX_AF('G', 13, AF11)

/* ETH0_MII_TXD1 */
#define ETH0_MII_TXD1_PB13 \
	GD32_PINMUX_AF('B', 13, AF11)
#define ETH0_MII_TXD1_PG12 \
	GD32_PINMUX_AF('G', 12, AF11)
#define ETH0_MII_TXD1_PG14 \
	GD32_PINMUX_AF('G', 14, AF11)

/* ETH0_MII_TXD2 */
#define ETH0_MII_TXD2_PC2 \
	GD32_PINMUX_AF('C', 2, AF11)

/* ETH0_MII_TXD3 */
#define ETH0_MII_TXD3_PB8 \
	GD32_PINMUX_AF('B', 8, AF11)
#define ETH0_MII_TXD3_PE2 \
	GD32_PINMUX_AF('E', 2, AF11)

/* ETH0_MII_TX_CLK */
#define ETH0_MII_TX_CLK_PC3 \
	GD32_PINMUX_AF('C', 3, AF11)

/* ETH0_MII_TX_EN */
#define ETH0_MII_TX_EN_PB11 \
	GD32_PINMUX_AF('B', 11, AF11)
#define ETH0_MII_TX_EN_PG11 \
	GD32_PINMUX_AF('G', 11, AF11)

