GD32-MCU-IOT/hal_gigadevice_zephyr/include/dt-bindings/pinctrl/gd32h759i(g-i-m)xx-pinctrl.h
/* ETH0_PPS_OUT */
#define ETH0_PPS_OUT_PB5 \
	GD32_PINMUX_AF('B', 5, AF11)
#define ETH0_PPS_OUT_PG8 \
	GD32_PINMUX_AF('G', 8, AF11)

/* ETH0_RMII_CRS_DV */
#define ETH0_RMII_CRS_DV_PA7 \
	GD32_PINMUX_AF('A', 7, AF11)

/* ETH0_RMII_REF_CLK */
#define ETH0_RMII_REF_CLK_PA1 \
	GD32_PINMUX_AF('A', 1, AF11)

/* ETH0_RMII_RXD0 */
#define ETH0_RMII_RXD0_PC4 \
	GD32_PINMUX_AF('C', 4, AF11)

/* ETH0_RMII_RXD1 */
#define ETH0_RMII_RXD1_PC5 \
	GD32_PINMUX_AF('C', 5, AF11)

/* ETH0_RMII_TXD0 */
#define ETH0_RMII_TXD0_PB12 \
	GD32_PINMUX_AF('B', 12, AF11)
#define ETH0_RMII_TXD0_PG13 \
	GD32_PINMUX_AF('G', 13, AF11)

/* ETH0_RMII_TXD1 */
#define ETH0_RMII_TXD1_PB13 \
	GD32_PINMUX_AF('B', 13, AF11)
#define ETH0_RMII_TXD1_PG12 \
	GD32_PINMUX_AF('G', 12, AF11)
#define ETH0_RMII_TXD1_PG14 \
	GD32_PINMUX_AF('G', 14, AF11)

/* ETH0_RMII_TX_EN */
#define ETH0_RMII_TX_EN_PB11 \
	GD32_PINMUX_AF('B', 11, AF11)
#define ETH0_RMII_TX_EN_PG11 \
	GD32_PINMUX_AF('G', 11, AF11)

/* ETH1_MDC */
#define ETH1_MDC_PG6 \
	GD32_PINMUX_AF('G', 6, AF6)

/* ETH1_MDIO */
#define ETH1_MDIO_PH14 \
	GD32_PINMUX_AF('H', 14, AF6)

/* ETH1_MII_COL */
#define ETH1_MII_COL_PH13 \
	GD32_PINMUX_AF('H', 13, AF6)

/* ETH1_MII_CRS */
#define ETH1_MII_CRS_PH15 \
	GD32_PINMUX_AF('H', 15, AF6)

/* ETH1_MII_RXD0 */
#define ETH1_MII_RXD0_PH8 \
	GD32_PINMUX_AF('H', 8, AF6)

/* ETH1_MII_RXD1 */
#define ETH1_MII_RXD1_PH9 \
	GD32_PINMUX_AF('H', 9, AF6)

/* ETH1_MII_RXD2 */
#define ETH1_MII_RXD2_PH6 \
	GD32_PINMUX_AF('H', 6, AF6)

/* ETH1_MII_RXD3 */
#define ETH1_MII_RXD3_PH7 \
	GD32_PINMUX_AF('H', 7, AF6)

/* ETH1_MII_RX_CLK */
#define ETH1_MII_RX_CLK_PH12 \
	GD32_PINMUX_AF('H', 12, AF6)

/* ETH1_MII_RX_DV */
#define ETH1_MII_RX_DV_PH11 \
	GD32_PINMUX_AF('H', 11, AF6)

/* ETH1_MII_RX_ER */
#define ETH1_MII_RX_ER_PH10 \
	GD32_PINMUX_AF('H', 10, AF6)

/* ETH1_MII_TXD0 */
#define ETH1_MII_TXD0_PG13 \
	GD32_PINMUX_AF('G', 13, AF6)

/* ETH1_MII_TXD1 */
#define ETH1_MII_TXD1_PG14 \
	GD32_PINMUX_AF('G', 14, AF6)

/* ETH1_MII_TXD2 */
#define ETH1_MII_TXD2_PG12 \
	GD32_PINMUX_AF('G', 12, AF6)

/* ETH1_MII_TXD3 */
#define ETH1_MII_TXD3_PG15 \
	GD32_PINMUX_AF('G', 15, AF6)

/* ETH1_MII_TX_CLK */
#define ETH1_MII_TX_CLK_PG9 \
	GD32_PINMUX_AF('G', 9, AF6)

/* ETH1_MII_TX_EN */
#define ETH1_MII_TX_EN_PG11 \
	GD32_PINMUX_AF('G', 11, AF6)

/* ETH1_PPS_OUT */
#define ETH1_PPS_OUT_PG8 \
	GD32_PINMUX_AF('G', 8, AF6)

/* ETH1_RMII_CRS_DV */
#define ETH1_RMII_CRS_DV_PH11 \
	GD32_PINMUX_AF('H', 11, AF6)

/* ETH1_RMII_REF_CLK */
#define ETH1_RMII_REF_CLK_PH12 \
	GD32_PINMUX_AF('H', 12, AF6)

/* ETH1_RMII_RXD0 */
#define ETH1_RMII_RXD0_PH8 \
	GD32_PINMUX_AF('H', 8, AF6)

/* ETH1_RMII_RXD1 */
#define ETH1_RMII_RXD1_PH9 \
	GD32_PINMUX_AF('H', 9, AF6)

/* ETH1_RMII_TXD0 */
#define ETH1_RMII_TXD0_PG13 \
	GD32_PINMUX_AF('G', 13, AF6)

/* ETH1_RMII_TXD1 */
#define ETH1_RMII_TXD1_PG14 \
	GD32_PINMUX_AF('G', 14, AF6)

/* ETH1_RMII_TX_EN */
#define ETH1_RMII_TX_EN_PG11 \
	GD32_PINMUX_AF('G', 11, AF6)

/* EVENTOUT */
#define EVENTOUT_PA0 \
	GD32_PINMUX_AF('A', 0, AF15)
#define EVENTOUT_PA1 \
	GD32_PINMUX_AF('A', 1, AF15)
#define EVENTOUT_PA2 \
	GD32_PINMUX_AF('A', 2, AF15)
#define EVENTOUT_PA3 \
	GD32_PINMUX_AF('A', 3, AF15)
#define EVENTOUT_PA4 \
	GD32_PINMUX_AF('A', 4, AF15)
#define EVENTOUT_PA5 \
	GD32_PINMUX_AF('A', 5, AF15)
#define EVENTOUT_PA6 \
	GD32_PINMUX_AF('A', 6, AF15)
#define EVENTOUT_PA7 \
	GD32_PINMUX_AF('A', 7, AF15)
#define EVENTOUT_PA8 \
	GD32_PINMUX_AF('A', 8, AF15)
#define EVENTOUT_PA9 \
	GD32_PINMUX_AF('A', 9, AF15)
#define EVENTOUT_PA10 \
	GD32_PINMUX_AF('A', 10, AF15)
#define EVENTOUT_PA13 \
	GD32_PINMUX_AF('A', 13, AF15)
#define EVENTOUT_PA14 \
	GD32_PINMUX_AF('A', 14, AF15)
#define EVENTOUT_PA15 \
	GD32_PINMUX_AF('A', 15, AF15)
#define EVENTOUT_PB0 \
	GD32_PINMUX_AF('B', 0, AF15)
#define EVENTOUT_PB1 \
	GD32_PINMUX_AF('B', 1, AF15)
#define EVENTOUT_PB2 \
	GD32_PINMUX_AF('B', 2, AF15)
#define EVENTOUT_PB3 \
	GD32_PINMUX_AF('B', 3, AF15)
#define EVENTOUT_PB4 \
	GD32_PINMUX_AF('B', 4, AF15)
#define EVENTOUT_PB5 \
	GD32_PINMUX_AF('B', 5, AF15)
#define EVENTOUT_PB6 \
	GD32_PINMUX_AF('B', 6, AF15)
#define EVENTOUT_PB7 \
	GD32_PINMUX_AF('B', 7, AF15)
#define EVENTOUT_PB8 \
	GD32_PINMUX_AF('B', 8, AF15)
#define EVENTOUT_PB9 \
	GD32_PINMUX_AF('B', 9, AF15)
#define EVENTOUT_PB10 \
	GD32_PINMUX_AF('B', 10, AF15)
#define EVENTOUT_PB11 \
	GD32_PINMUX_AF('B', 11, AF15)
#define EVENTOUT_PB12 \
	GD32_PINMUX_AF('B', 12, AF15)
#define EVENTOUT_PB13 \
	GD32_PINMUX_AF('B', 13, AF15)
#define EVENTOUT_PC0 \
	GD32_PINMUX_AF('C', 0, AF15)
#define EVENTOUT_PC1 \
	GD32_PINMUX_AF('C', 1, AF15)
#define EVENTOUT_PC2 \
	GD32_PINMUX_AF('C', 2, AF15)
#define EVENTOUT_PC3 \
	GD32_PINMUX_AF('C', 3, AF15)
#define EVENTOUT_PC4 \
	GD32_PINMUX_AF('C', 4, AF15)
#define EVENTOUT_PC5 \
	GD32_PINMUX_AF('C', 5, AF15)
#define EVENTOUT_PC6 \
	GD32_PINMUX_AF('C', 6, AF15)
#define EVENTOUT_PC7 \
	GD32_PINMUX_AF('C', 7, AF15)
#define EVENTOUT_PC8 \
	GD32_PINMUX_AF('C', 8, AF15)
#define EVENTOUT_PC9 \
	GD32_PINMUX_AF('C', 9, AF15)
#define EVENTOUT_PC10 \
	GD32_PINMUX_AF('C', 10, AF15)
#define EVENTOUT_PC11 \
	GD32_PINMUX_AF('C', 11, AF15)
#define EVENTOUT_PC12 \
	GD32_PINMUX_AF('C', 12, AF15)
#define EVENTOUT_PC13 \
	GD32_PINMUX_AF('C', 13, AF15)
#define EVENTOUT_PC14 \
	GD32_PINMUX_AF('C', 14, AF15)
#define EVENTOUT_PC15 \
	GD32_PINMUX_AF('C', 15, AF15)
#define EVENTOUT_PD0 \
	GD32_PINMUX_AF('D', 0, AF15)
#define EVENTOUT_PD1 \
	GD32_PINMUX_AF('D', 1, AF15)
#define EVENTOUT_PD2 \
	GD32_PINMUX_AF('D', 2, AF15)
#define EVENTOUT_PD3 \
	GD32_PINMUX_AF('D', 3, AF15)
#define EVENTOUT_PD4 \
	GD32_PINMUX_AF('D', 4, AF15)
#define EVENTOUT_PD5 \
	GD32_PINMUX_AF('D', 5, AF15)
#define EVENTOUT_PD6 \
	GD32_PINMUX_AF('D', 6, AF15)
#define EVENTOUT_PD7 \
	GD32_PINMUX_AF('D', 7, AF15)
#define EVENTOUT_PD8 \
	GD32_PINMUX_AF('D', 8, AF15)
#define EVENTOUT_PD9 \
	GD32_PINMUX_AF('D', 9, AF15)
#define EVENTOUT_PD10 \
	GD32_PINMUX_AF('D', 10, AF15)
#define EVENTOUT_PD11 \
	GD32_PINMUX_AF('D', 11, AF15)
#define EVENTOUT_PD12 \
	GD32_PINMUX_AF('D', 12, AF15)
#define EVENTOUT_PD13 \
	GD32_PINMUX_AF('D', 13, AF15)
#define EVENTOUT_PD14 \
	GD32_PINMUX_AF('D', 14, AF15)
#define EVENTOUT_PD15 \
	GD32_PINMUX_AF('D', 15, AF15)
#define EVENTOUT_PE0 \
	GD32_PINMUX_AF('E', 0, AF15)
#define EVENTOUT_PE1 \
	GD32_PINMUX_AF('E', 1, AF15)
#define EVENTOUT_PE2 \
	GD32_PINMUX_AF('E', 2, AF15)
#define EVENTOUT_PE3 \
	GD32_PINMUX_AF('E', 3, AF15)
#define EVENTOUT_PE4 \
	GD32_PINMUX_AF('E', 4, AF15)
#define EVENTOUT_PE5 \
	GD32_PINMUX_AF('E', 5, AF15)
#define EVENTOUT_PE6 \
	GD32_PINMUX_AF('E', 6, AF15)
#define EVENTOUT_PE7 \
	GD32_PINMUX_AF('E', 7, AF15)
#define EVENTOUT_PE8 \
	GD32_PINMUX_AF('E', 8, AF15)
#define EVENTOUT_PE9 \
	GD32_PINMUX_AF('E', 9, AF15)
#define EVENTOUT_PE10 \
	GD32_PINMUX_AF('E', 10, AF15)
#define EVENTOUT_PE11 \
	GD32_PINMUX_AF('E', 11, AF15)
#define EVENTOUT_PE12 \
	GD32_PINMUX_AF('E', 12, AF15)
#define EVENTOUT_PE13 \
	GD32_PINMUX_AF('E', 13, AF15)
#define EVENTOUT_PE14 \
	GD32_PINMUX_AF('E', 14, AF15)
#define EVENTOUT_PE15 \
	GD32_PINMUX_AF('E', 15, AF15)
#define EVENTOUT_PF0 \
	GD32_PINMUX_AF('F', 0, AF15)
#define EVENTOUT_PF1 \
	GD32_PINMUX_AF('F', 1, AF15)
#define EVENTOUT_PF2 \
	GD32_PINMUX_AF('F', 2, AF15)
#define EVENTOUT_PF3 \
	GD32_PINMUX_AF('F', 3, AF15)
#define EVENTOUT_PF4 \
	GD32_PINMUX_AF('F', 4, AF15)
#define EVENTOUT_PF5 \
	GD32_PINMUX_AF('F', 5, AF15)
#define EVENTOUT_PF6 \
	GD32_PINMUX_AF('F', 6, AF15)
#define EVENTOUT_PF7 \
	GD32_PINMUX_AF('F', 7, AF15)
#define EVENTOUT_PF8 \
	GD32_PINMUX_AF('F', 8, AF15)
#define EVENTOUT_PF9 \
	GD32_PINMUX_AF('F', 9, AF15)
#define EVENTOUT_PF10 \
	GD32_PINMUX_AF('F', 10, AF15)
#define EVENTOUT_PF11 \
	GD32_PINMUX_AF('F', 11, AF15)
#define EVENTOUT_PF12 \
	GD32_PINMUX_AF('F', 12, AF15)
#define EVENTOUT_PF13 \
	GD32_PINMUX_AF('F', 13, AF15)
#define EVENTOUT_PF14 \
	GD32_PINMUX_AF('F', 14, AF15)
#define EVENTOUT_PF15 \
	GD32_PINMUX_AF('F', 15, AF15)
#define EVENTOUT_PG0 \
	GD32_PINMUX_AF('G', 0, AF15)
#define EVENTOUT_PG1 \
	GD32_PINMUX_AF('G', 1, AF15)
#define EVENTOUT_PG2 \
	GD32_PINMUX_AF('G', 2, AF15)
#define EVENTOUT_PG3 \
	GD32_PINMUX_AF('G', 3, AF15)
#define EVENTOUT_PG4 \
	GD32_PINMUX_AF('G', 4, AF15)
#define EVENTOUT_PG5 \
	GD32_PINMUX_AF('G', 5, AF15)
#define EVENTOUT_PG6 \
	GD32_PINMUX_AF('G', 6, AF15)
#define EVENTOUT_PG7 \
	GD32_PINMUX_AF('G', 7, AF15)
#define EVENTOUT_PG8 \
	GD32_PINMUX_AF('G', 8, AF15)
#define EVENTOUT_PG9 \
	GD32_PINMUX_AF('G', 9, AF15)
#define EVENTOUT_PG10 \
	GD32_PINMUX_AF('G', 10, AF15)
#define EVENTOUT_PG11 \
	GD32_PINMUX_AF('G', 11, AF15)
#define EVENTOUT_PG12 \
	GD32_PINMUX_AF('G', 12, AF15)
#define EVENTOUT_PG13 \
	GD32_PINMUX_AF('G', 13, AF15)
#define EVENTOUT_PG14 \
	GD32_PINMUX_AF('G', 14, AF15)
#define EVENTOUT_PG15 \
	GD32_PINMUX_AF('G', 15, AF15)
#define EVENTOUT_PH0 \
	GD32_PINMUX_AF('H', 0, AF15)
#define EVENTOUT_PH1 \
	GD32_PINMUX_AF('H', 1, AF15)
#define EVENTOUT_PH2 \
	GD32_PINMUX_AF('H', 2, AF15)
#define EVENTOUT_PH3 \
	GD32_PINMUX_AF('H', 3, AF15)
#define EVENTOUT_PH4 \
	GD32_PINMUX_AF('H', 4, AF15)
#define EVENTOUT_PH5 \
	GD32_PINMUX_AF('H', 5, AF15)
#define EVENTOUT_PH6 \
	GD32_PINMUX_AF('H', 6, AF15)
#define EVENTOUT_PH7 \
	GD32_PINMUX_AF('H', 7, AF15)
#define EVENTOUT_PH8 \
	GD32_PINMUX_AF('H', 8, AF15)
#define EVENTOUT_PH9 \
	GD32_PINMUX_AF('H', 9, AF15)
#define EVENTOUT_PH10 \
	GD32_PINMUX_AF('H', 10, AF15)
#define EVENTOUT_PH11 \
	GD32_PINMUX_AF('H', 11, AF15)
#define EVENTOUT_PH12 \
	GD32_PINMUX_AF('H', 12, AF15)
#define EVENTOUT_PH13 \
	GD32_PINMUX_AF('H', 13, AF15)
#define EVENTOUT_PH14 \
	GD32_PINMUX_AF('H', 14, AF15)
#define EVENTOUT_PH15 \
	GD32_PINMUX_AF('H', 15, AF15)
#define EVENTOUT_PJ8 \
	GD32_PINMUX_AF('J', 8, AF15)
#define EVENTOUT_PJ9 \
	GD32_PINMUX_AF('J', 9, AF15)
#define EVENTOUT_PJ10 \
	GD32_PINMUX_AF('J', 10, AF15)
#define EVENTOUT_PJ11 \
	GD32_PINMUX_AF('J', 11, AF15)
#define EVENTOUT_PK0 \
	GD32_PINMUX_AF('K', 0, AF15)
#define EVENTOUT_PK1 \
	GD32_PINMUX_AF('K', 1, AF15)
#define EVENTOUT_PK2 \
	GD32_PINMUX_AF('K', 2, AF15)

/* EXMC_A0 */
#define EXMC_A0_PF0 \
	GD32_PINMUX_AF('F', 0, AF12)

