GD32-MCU-IOT/hal_gigadevice_zephyr/include/dt-bindings/pinctrl/gd32h759i(g-i-m)xx-pinctrl.h
/* I2S2_WS */
#define I2S2_WS_PA4 \
	GD32_PINMUX_AF('A', 4, AF6)
#define I2S2_WS_PA15 \
	GD32_PINMUX_AF('A', 15, AF6)

/* I2S5_CK */
#define I2S5_CK_PA5 \
	GD32_PINMUX_AF('A', 5, AF8)
#define I2S5_CK_PB3 \
	GD32_PINMUX_AF('B', 3, AF8)
#define I2S5_CK_PC12 \
	GD32_PINMUX_AF('C', 12, AF5)
#define I2S5_CK_PG13 \
	GD32_PINMUX_AF('G', 13, AF5)

/* I2S5_MCK */
#define I2S5_MCK_PA3 \
	GD32_PINMUX_AF('A', 3, AF5)

/* I2S5_SD */
#define I2S5_SD_PA7 \
	GD32_PINMUX_AF('A', 7, AF8)
#define I2S5_SD_PB5 \
	GD32_PINMUX_AF('B', 5, AF8)
#define I2S5_SD_PG14 \
	GD32_PINMUX_AF('G', 14, AF5)

/* I2S5_WS */
#define I2S5_WS_PA0 \
	GD32_PINMUX_AF('A', 0, AF5)
#define I2S5_WS_PA4 \
	GD32_PINMUX_AF('A', 4, AF8)
#define I2S5_WS_PA15 \
	GD32_PINMUX_AF('A', 15, AF7)
#define I2S5_WS_PG8 \
	GD32_PINMUX_AF('G', 8, AF5)

/* I2S_CKIN */
#define I2S_CKIN_PC9 \
	GD32_PINMUX_AF('C', 9, AF5)

/* JTCK */
#define JTCK_PA14 \
	GD32_PINMUX_AF('A', 14, AF0)

/* JTDI */
#define JTDI_PA15 \
	GD32_PINMUX_AF('A', 15, AF0)

/* JTDO */
#define JTDO_PB3 \
	GD32_PINMUX_AF('B', 3, AF0)

/* JTMS */
#define JTMS_PA13 \
	GD32_PINMUX_AF('A', 13, AF0)

/* MDIO */
#define MDIO_PA2 \
	GD32_PINMUX_AF('A', 2, AF12)
#define MDIO_PA10 \
	GD32_PINMUX_AF('A', 10, AF11)

/* MDIO_A0 */
#define MDIO_A0_PA5 \
	GD32_PINMUX_AF('A', 5, AF11)
#define MDIO_A0_PA15 \
	GD32_PINMUX_AF('A', 15, AF12)

/* MDIO_A1 */
#define MDIO_A1_PB0 \
	GD32_PINMUX_AF('B', 0, AF12)
#define MDIO_A1_PC10 \
	GD32_PINMUX_AF('C', 10, AF11)

/* MDIO_A2 */
#define MDIO_A2_PB1 \
	GD32_PINMUX_AF('B', 1, AF12)
#define MDIO_A2_PC11 \
	GD32_PINMUX_AF('C', 11, AF11)

/* MDIO_A3 */
#define MDIO_A3_PA13 \
	GD32_PINMUX_AF('A', 13, AF11)
#define MDIO_A3_PB2 \
	GD32_PINMUX_AF('B', 2, AF12)

/* MDIO_A4 */
#define MDIO_A4_PA14 \
	GD32_PINMUX_AF('A', 14, AF11)
#define MDIO_A4_PB3 \
	GD32_PINMUX_AF('B', 3, AF12)

/* MDIO_MDC */
#define MDIO_MDC_PA6 \
	GD32_PINMUX_AF('A', 6, AF11)
#define MDIO_MDC_PC1 \
	GD32_PINMUX_AF('C', 1, AF12)

/* NJTRST */
#define NJTRST_PB4 \
	GD32_PINMUX_AF('B', 4, AF0)

/* OSPIM_P0_CSN */
#define OSPIM_P0_CSN_PB6 \
	GD32_PINMUX_AF('B', 6, AF10)
#define OSPIM_P0_CSN_PB10 \
	GD32_PINMUX_AF('B', 10, AF9)
#define OSPIM_P0_CSN_PC11 \
	GD32_PINMUX_AF('C', 11, AF9)
#define OSPIM_P0_CSN_PE11 \
	GD32_PINMUX_AF('E', 11, AF11)
#define OSPIM_P0_CSN_PG6 \
	GD32_PINMUX_AF('G', 6, AF10)

/* OSPIM_P0_IO0 */
#define OSPIM_P0_IO0_PA2 \
	GD32_PINMUX_AF('A', 2, AF6)
#define OSPIM_P0_IO0_PB1 \
	GD32_PINMUX_AF('B', 1, AF4)
#define OSPIM_P0_IO0_PB12 \
	GD32_PINMUX_AF('B', 12, AF12)
#define OSPIM_P0_IO0_PC3 \
	GD32_PINMUX_AF('C', 3, AF9)
#define OSPIM_P0_IO0_PC9 \
	GD32_PINMUX_AF('C', 9, AF9)
#define OSPIM_P0_IO0_PD11 \
	GD32_PINMUX_AF('D', 11, AF9)
#define OSPIM_P0_IO0_PF8 \
	GD32_PINMUX_AF('F', 8, AF10)

/* OSPIM_P0_IO1 */
#define OSPIM_P0_IO1_PB0 \
	GD32_PINMUX_AF('B', 0, AF4)
#define OSPIM_P0_IO1_PC10 \
	GD32_PINMUX_AF('C', 10, AF9)
#define OSPIM_P0_IO1_PD12 \
	GD32_PINMUX_AF('D', 12, AF9)
#define OSPIM_P0_IO1_PF9 \
	GD32_PINMUX_AF('F', 9, AF10)

/* OSPIM_P0_IO2 */
#define OSPIM_P0_IO2_PA3 \
	GD32_PINMUX_AF('A', 3, AF6)
#define OSPIM_P0_IO2_PA7 \
	GD32_PINMUX_AF('A', 7, AF10)
#define OSPIM_P0_IO2_PB13 \
	GD32_PINMUX_AF('B', 13, AF4)
#define OSPIM_P0_IO2_PC2 \
	GD32_PINMUX_AF('C', 2, AF9)
#define OSPIM_P0_IO2_PE2 \
	GD32_PINMUX_AF('E', 2, AF9)
#define OSPIM_P0_IO2_PF7 \
	GD32_PINMUX_AF('F', 7, AF10)

/* OSPIM_P0_IO3 */
#define OSPIM_P0_IO3_PA1 \
	GD32_PINMUX_AF('A', 1, AF9)
#define OSPIM_P0_IO3_PA6 \
	GD32_PINMUX_AF('A', 6, AF6)
#define OSPIM_P0_IO3_PD13 \
	GD32_PINMUX_AF('D', 13, AF9)
#define OSPIM_P0_IO3_PF6 \
	GD32_PINMUX_AF('F', 6, AF10)

/* OSPIM_P0_IO4 */
#define OSPIM_P0_IO4_PC1 \
	GD32_PINMUX_AF('C', 1, AF10)
#define OSPIM_P0_IO4_PD4 \
	GD32_PINMUX_AF('D', 4, AF10)
#define OSPIM_P0_IO4_PE7 \
	GD32_PINMUX_AF('E', 7, AF10)
#define OSPIM_P0_IO4_PH2 \
	GD32_PINMUX_AF('H', 2, AF9)

/* OSPIM_P0_IO5 */
#define OSPIM_P0_IO5_PC2 \
	GD32_PINMUX_AF('C', 2, AF4)
#define OSPIM_P0_IO5_PD5 \
	GD32_PINMUX_AF('D', 5, AF10)
#define OSPIM_P0_IO5_PE8 \
	GD32_PINMUX_AF('E', 8, AF10)
#define OSPIM_P0_IO5_PH3 \
	GD32_PINMUX_AF('H', 3, AF9)

/* OSPIM_P0_IO6 */
#define OSPIM_P0_IO6_PA0 \
	GD32_PINMUX_AF('A', 0, AF6)
#define OSPIM_P0_IO6_PC3 \
	GD32_PINMUX_AF('C', 3, AF4)
#define OSPIM_P0_IO6_PD6 \
	GD32_PINMUX_AF('D', 6, AF10)
#define OSPIM_P0_IO6_PE9 \
	GD32_PINMUX_AF('E', 9, AF10)
#define OSPIM_P0_IO6_PG9 \
	GD32_PINMUX_AF('G', 9, AF9)

/* OSPIM_P0_IO7 */
#define OSPIM_P0_IO7_PD7 \
	GD32_PINMUX_AF('D', 7, AF10)
#define OSPIM_P0_IO7_PE10 \
	GD32_PINMUX_AF('E', 10, AF10)
#define OSPIM_P0_IO7_PG14 \
	GD32_PINMUX_AF('G', 14, AF9)

/* OSPIM_P0_SCK */
#define OSPIM_P0_SCK_PA3 \
	GD32_PINMUX_AF('A', 3, AF12)
#define OSPIM_P0_SCK_PB2 \
	GD32_PINMUX_AF('B', 2, AF9)
#define OSPIM_P0_SCK_PF10 \
	GD32_PINMUX_AF('F', 10, AF9)

/* OSPIM_P1_CSN */
#define OSPIM_P1_CSN_PG12 \
	GD32_PINMUX_AF('G', 12, AF3)

/* OSPIM_P1_IO0 */
#define OSPIM_P1_IO0_PF0 \
	GD32_PINMUX_AF('F', 0, AF9)

/* OSPIM_P1_IO1 */
#define OSPIM_P1_IO1_PF1 \
	GD32_PINMUX_AF('F', 1, AF9)

/* OSPIM_P1_IO2 */
#define OSPIM_P1_IO2_PF2 \
	GD32_PINMUX_AF('F', 2, AF9)

/* OSPIM_P1_IO3 */
#define OSPIM_P1_IO3_PF3 \
	GD32_PINMUX_AF('F', 3, AF9)

/* OSPIM_P1_IO4 */
#define OSPIM_P1_IO4_PG0 \
	GD32_PINMUX_AF('G', 0, AF9)

/* OSPIM_P1_IO5 */
#define OSPIM_P1_IO5_PG1 \
	GD32_PINMUX_AF('G', 1, AF9)

/* OSPIM_P1_IO6 */
#define OSPIM_P1_IO6_PG10 \
	GD32_PINMUX_AF('G', 10, AF3)

/* OSPIM_P1_IO7 */
#define OSPIM_P1_IO7_PG11 \
	GD32_PINMUX_AF('G', 11, AF9)

/* OSPIM_P1_SCK */
#define OSPIM_P1_SCK_PF4 \
	GD32_PINMUX_AF('F', 4, AF9)

/* PMU_DEEPSLEEP */
#define PMU_DEEPSLEEP_PC2 \
	GD32_PINMUX_AF('C', 2, AF0)
#define PMU_DEEPSLEEP_PC4 \
	GD32_PINMUX_AF('C', 4, AF0)

/* PMU_SLEEP */
#define PMU_SLEEP_PC3 \
	GD32_PINMUX_AF('C', 3, AF0)
#define PMU_SLEEP_PC5 \
	GD32_PINMUX_AF('C', 5, AF0)

/* RSPDIF_CH0 */
#define RSPDIF_CH0_PD7 \
	GD32_PINMUX_AF('D', 7, AF9)
#define RSPDIF_CH0_PG11 \
	GD32_PINMUX_AF('G', 11, AF8)

/* RSPDIF_CH1 */
#define RSPDIF_CH1_PD8 \
	GD32_PINMUX_AF('D', 8, AF9)
#define RSPDIF_CH1_PG12 \
	GD32_PINMUX_AF('G', 12, AF8)

/* RSPDIF_CH2 */
#define RSPDIF_CH2_PC4 \
	GD32_PINMUX_AF('C', 4, AF9)
#define RSPDIF_CH2_PG8 \
	GD32_PINMUX_AF('G', 8, AF8)

/* RSPDIF_CH3 */
#define RSPDIF_CH3_PC5 \
	GD32_PINMUX_AF('C', 5, AF9)
#define RSPDIF_CH3_PG9 \
	GD32_PINMUX_AF('G', 9, AF8)

/* RTC_OUT */
#define RTC_OUT_PB2 \
	GD32_PINMUX_AF('B', 2, AF0)

