GD32-MCU-IOT/hal_gigadevice_zephyr/include/dt-bindings/pinctrl/gd32h759i(g-i-m)xx-pinctrl.h
/* RTC_REFIN */
#define RTC_REFIN_PB13 \
	GD32_PINMUX_AF('B', 13, AF0)

/* SAI0_CLK0 */
#define SAI0_CLK0_PE2 \
	GD32_PINMUX_AF('E', 2, AF2)

/* SAI0_CLK1 */
#define SAI0_CLK1_PE5 \
	GD32_PINMUX_AF('E', 5, AF2)

/* SAI0_DAT0 */
#define SAI0_DAT0_PB2 \
	GD32_PINMUX_AF('B', 2, AF2)
#define SAI0_DAT0_PC1 \
	GD32_PINMUX_AF('C', 1, AF2)
#define SAI0_DAT0_PD6 \
	GD32_PINMUX_AF('D', 6, AF2)
#define SAI0_DAT0_PE6 \
	GD32_PINMUX_AF('E', 6, AF2)

/* SAI0_DAT1 */
#define SAI0_DAT1_PE4 \
	GD32_PINMUX_AF('E', 4, AF2)

/* SAI0_DAT2 */
#define SAI0_DAT2_PC5 \
	GD32_PINMUX_AF('C', 5, AF2)
#define SAI0_DAT2_PF10 \
	GD32_PINMUX_AF('F', 10, AF2)

/* SAI0_FS0 */
#define SAI0_FS0_PE4 \
	GD32_PINMUX_AF('E', 4, AF6)

/* SAI0_FS1 */
#define SAI0_FS1_PF9 \
	GD32_PINMUX_AF('F', 9, AF6)

/* SAI0_MCLK0 */
#define SAI0_MCLK0_PE2 \
	GD32_PINMUX_AF('E', 2, AF6)
#define SAI0_MCLK0_PG7 \
	GD32_PINMUX_AF('G', 7, AF6)

/* SAI0_MCLK1 */
#define SAI0_MCLK1_PF7 \
	GD32_PINMUX_AF('F', 7, AF6)

/* SAI0_SCK0 */
#define SAI0_SCK0_PE5 \
	GD32_PINMUX_AF('E', 5, AF6)

/* SAI0_SCK1 */
#define SAI0_SCK1_PF8 \
	GD32_PINMUX_AF('F', 8, AF6)

/* SAI0_SD0 */
#define SAI0_SD0_PB2 \
	GD32_PINMUX_AF('B', 2, AF6)
#define SAI0_SD0_PC1 \
	GD32_PINMUX_AF('C', 1, AF6)
#define SAI0_SD0_PD6 \
	GD32_PINMUX_AF('D', 6, AF6)
#define SAI0_SD0_PE6 \
	GD32_PINMUX_AF('E', 6, AF6)

/* SAI0_SD1 */
#define SAI0_SD1_PE3 \
	GD32_PINMUX_AF('E', 3, AF6)
#define SAI0_SD1_PF6 \
	GD32_PINMUX_AF('F', 6, AF6)

/* SAI1_CLK0 */
#define SAI1_CLK0_PD8 \
	GD32_PINMUX_AF('D', 8, AF8)

/* SAI1_CLK1 */
#define SAI1_CLK1_PD9 \
	GD32_PINMUX_AF('D', 9, AF8)

/* SAI1_DAT0 */
#define SAI1_DAT0_PD6 \
	GD32_PINMUX_AF('D', 6, AF1)

/* SAI1_DAT1 */
#define SAI1_DAT1_PD10 \
	GD32_PINMUX_AF('D', 10, AF8)

/* SAI1_DAT2 */
#define SAI1_DAT2_PD11 \
	GD32_PINMUX_AF('D', 11, AF8)

/* SAI1_FS0 */
#define SAI1_FS0_PD12 \
	GD32_PINMUX_AF('D', 12, AF10)

/* SAI1_FS1 */
#define SAI1_FS1_PA14 \
	GD32_PINMUX_AF('A', 14, AF8)
#define SAI1_FS1_PC0 \
	GD32_PINMUX_AF('C', 0, AF8)
#define SAI1_FS1_PE13 \
	GD32_PINMUX_AF('E', 13, AF10)
#define SAI1_FS1_PG9 \
	GD32_PINMUX_AF('G', 9, AF10)

/* SAI1_MCLK0 */
#define SAI1_MCLK0_PE0 \
	GD32_PINMUX_AF('E', 0, AF10)

/* SAI1_MCLK1 */
#define SAI1_MCLK1_PA1 \
	GD32_PINMUX_AF('A', 1, AF10)
#define SAI1_MCLK1_PE6 \
	GD32_PINMUX_AF('E', 6, AF10)
#define SAI1_MCLK1_PE14 \
	GD32_PINMUX_AF('E', 14, AF10)
#define SAI1_MCLK1_PH3 \
	GD32_PINMUX_AF('H', 3, AF10)

/* SAI1_SCK0 */
#define SAI1_SCK0_PD13 \
	GD32_PINMUX_AF('D', 13, AF10)

/* SAI1_SCK1 */
#define SAI1_SCK1_PA2 \
	GD32_PINMUX_AF('A', 2, AF8)
#define SAI1_SCK1_PE12 \
	GD32_PINMUX_AF('E', 12, AF10)
#define SAI1_SCK1_PH2 \
	GD32_PINMUX_AF('H', 2, AF10)

/* SAI1_SD0 */
#define SAI1_SD0_PD11 \
	GD32_PINMUX_AF('D', 11, AF10)

/* SAI1_SD1 */
#define SAI1_SD1_PA0 \
	GD32_PINMUX_AF('A', 0, AF10)
#define SAI1_SD1_PE11 \
	GD32_PINMUX_AF('E', 11, AF10)
#define SAI1_SD1_PF11 \
	GD32_PINMUX_AF('F', 11, AF10)
#define SAI1_SD1_PG10 \
	GD32_PINMUX_AF('G', 10, AF10)

/* SAI2_CLK0 */
#define SAI2_CLK0_PE2 \
	GD32_PINMUX_AF('E', 2, AF10)

/* SAI2_CLK1 */
#define SAI2_CLK1_PE5 \
	GD32_PINMUX_AF('E', 5, AF10)

/* SAI2_DAT0 */
#define SAI2_DAT0_PB2 \
	GD32_PINMUX_AF('B', 2, AF1)
#define SAI2_DAT0_PC1 \
	GD32_PINMUX_AF('C', 1, AF1)
#define SAI2_DAT0_PE6 \
	GD32_PINMUX_AF('E', 6, AF9)

/* SAI2_DAT1 */
#define SAI2_DAT1_PE4 \
	GD32_PINMUX_AF('E', 4, AF10)

/* SAI2_DAT2 */
#define SAI2_DAT2_PC5 \
	GD32_PINMUX_AF('C', 5, AF1)
#define SAI2_DAT2_PF10 \
	GD32_PINMUX_AF('F', 10, AF10)

/* SAI2_FS0 */
#define SAI2_FS0_PE4 \
	GD32_PINMUX_AF('E', 4, AF8)

/* SAI2_FS1 */
#define SAI2_FS1_PF9 \
	GD32_PINMUX_AF('F', 9, AF8)

/* SAI2_MCLK0 */
#define SAI2_MCLK0_PE2 \
	GD32_PINMUX_AF('E', 2, AF8)

/* SAI2_MCLK1 */
#define SAI2_MCLK1_PF7 \
	GD32_PINMUX_AF('F', 7, AF8)

/* SAI2_SCK0 */
#define SAI2_SCK0_PE5 \
	GD32_PINMUX_AF('E', 5, AF8)

/* SAI2_SCK1 */
#define SAI2_SCK1_PF8 \
	GD32_PINMUX_AF('F', 8, AF8)

/* SAI2_SD0 */
#define SAI2_SD0_PB2 \
	GD32_PINMUX_AF('B', 2, AF8)
#define SAI2_SD0_PC1 \
	GD32_PINMUX_AF('C', 1, AF8)
#define SAI2_SD0_PD6 \
	GD32_PINMUX_AF('D', 6, AF8)
#define SAI2_SD0_PE6 \
	GD32_PINMUX_AF('E', 6, AF8)

/* SAI2_SD1 */
#define SAI2_SD1_PE3 \
	GD32_PINMUX_AF('E', 3, AF8)
#define SAI2_SD1_PF6 \
	GD32_PINMUX_AF('F', 6, AF8)

/* SDIO0_CK */
#define SDIO0_CK_PC12 \
	GD32_PINMUX_AF('C', 12, AF12)

/* SDIO0_CKIN */
#define SDIO0_CKIN_PB8 \
	GD32_PINMUX_AF('B', 8, AF7)

/* SDIO0_CMD */
#define SDIO0_CMD_PD2 \
	GD32_PINMUX_AF('D', 2, AF12)

/* SDIO0_CMDDIR */
#define SDIO0_CMDDIR_PB9 \
	GD32_PINMUX_AF('B', 9, AF7)

/* SDIO0_D0 */
#define SDIO0_D0_PB13 \
	GD32_PINMUX_AF('B', 13, AF12)
#define SDIO0_D0_PC8 \
	GD32_PINMUX_AF('C', 8, AF12)

/* SDIO0_D1 */
#define SDIO0_D1_PC9 \
	GD32_PINMUX_AF('C', 9, AF12)

/* SDIO0_D2 */
#define SDIO0_D2_PC10 \
	GD32_PINMUX_AF('C', 10, AF12)

/* SDIO0_D3 */
#define SDIO0_D3_PC11 \
	GD32_PINMUX_AF('C', 11, AF12)

/* SDIO0_D4 */
#define SDIO0_D4_PB8 \
	GD32_PINMUX_AF('B', 8, AF12)

/* SDIO0_D5 */
#define SDIO0_D5_PB9 \
	GD32_PINMUX_AF('B', 9, AF12)

/* SDIO0_D6 */
#define SDIO0_D6_PC6 \
	GD32_PINMUX_AF('C', 6, AF12)

/* SDIO0_D7 */
#define SDIO0_D7_PC7 \
	GD32_PINMUX_AF('C', 7, AF12)

/* SDIO0_DAT0DIR */
#define SDIO0_DAT0DIR_PC6 \
	GD32_PINMUX_AF('C', 6, AF8)

/* SDIO0_DAT123DIR */
#define SDIO0_DAT123DIR_PC7 \
	GD32_PINMUX_AF('C', 7, AF8)

/* SDIO1_CK */
#define SDIO1_CK_PC1 \
	GD32_PINMUX_AF('C', 1, AF9)
#define SDIO1_CK_PD6 \
	GD32_PINMUX_AF('D', 6, AF11)

/* SDIO1_CKIN */
#define SDIO1_CKIN_PC4 \
	GD32_PINMUX_AF('C', 4, AF10)

/* SDIO1_CMD */
#define SDIO1_CMD_PA0 \
	GD32_PINMUX_AF('A', 0, AF9)
#define SDIO1_CMD_PD7 \
	GD32_PINMUX_AF('D', 7, AF11)

/* SDIO1_D0 */
#define SDIO1_D0_PF4 \
	GD32_PINMUX_AF('F', 4, AF10)
#define SDIO1_D0_PG9 \
	GD32_PINMUX_AF('G', 9, AF11)

/* SDIO1_D1 */
#define SDIO1_D1_PF5 \
	GD32_PINMUX_AF('F', 5, AF10)
#define SDIO1_D1_PG10 \
	GD32_PINMUX_AF('G', 10, AF11)

/* SDIO1_D2 */
#define SDIO1_D2_PB3 \
	GD32_PINMUX_AF('B', 3, AF9)
#define SDIO1_D2_PG11 \
	GD32_PINMUX_AF('G', 11, AF10)

/* SDIO1_D3 */
#define SDIO1_D3_PB4 \
	GD32_PINMUX_AF('B', 4, AF9)
#define SDIO1_D3_PG12 \
	GD32_PINMUX_AF('G', 12, AF10)

/* SDIO1_D4 */
#define SDIO1_D4_PB8 \
	GD32_PINMUX_AF('B', 8, AF10)

/* SDIO1_D5 */
#define SDIO1_D5_PB9 \
	GD32_PINMUX_AF('B', 9, AF10)

/* SDIO1_D6 */
#define SDIO1_D6_PC6 \
	GD32_PINMUX_AF('C', 6, AF10)
#define SDIO1_D6_PG13 \
	GD32_PINMUX_AF('G', 13, AF10)

