GD32-MCU-IOT/hal_gigadevice_zephyr/include/dt-bindings/pinctrl/gd32h759i(g-i-m)xx-pinctrl.h
/* SDIO1_D7 */
#define SDIO1_D7_PC7 \
	GD32_PINMUX_AF('C', 7, AF10)
#define SDIO1_D7_PG14 \
	GD32_PINMUX_AF('G', 14, AF10)

/* SPI0_MISO */
#define SPI0_MISO_PA6 \
	GD32_PINMUX_AF('A', 6, AF5)
#define SPI0_MISO_PB4 \
	GD32_PINMUX_AF('B', 4, AF5)
#define SPI0_MISO_PG9 \
	GD32_PINMUX_AF('G', 9, AF5)

/* SPI0_MOSI */
#define SPI0_MOSI_PA7 \
	GD32_PINMUX_AF('A', 7, AF5)
#define SPI0_MOSI_PB5 \
	GD32_PINMUX_AF('B', 5, AF5)
#define SPI0_MOSI_PD7 \
	GD32_PINMUX_AF('D', 7, AF5)

/* SPI0_NSS */
#define SPI0_NSS_PA4 \
	GD32_PINMUX_AF('A', 4, AF5)
#define SPI0_NSS_PA15 \
	GD32_PINMUX_AF('A', 15, AF5)
#define SPI0_NSS_PG10 \
	GD32_PINMUX_AF('G', 10, AF5)

/* SPI0_SCK */
#define SPI0_SCK_PA5 \
	GD32_PINMUX_AF('A', 5, AF5)
#define SPI0_SCK_PB3 \
	GD32_PINMUX_AF('B', 3, AF5)
#define SPI0_SCK_PG11 \
	GD32_PINMUX_AF('G', 11, AF5)

/* SPI1_MISO */
#define SPI1_MISO_PC2 \
	GD32_PINMUX_AF('C', 2, AF5)
#define SPI1_MISO_PG2 \
	GD32_PINMUX_AF('G', 2, AF5)

/* SPI1_MOSI */
#define SPI1_MOSI_PC1 \
	GD32_PINMUX_AF('C', 1, AF5)
#define SPI1_MOSI_PC3 \
	GD32_PINMUX_AF('C', 3, AF5)
#define SPI1_MOSI_PG3 \
	GD32_PINMUX_AF('G', 3, AF5)

/* SPI1_NSS */
#define SPI1_NSS_PA13 \
	GD32_PINMUX_AF('A', 13, AF5)
#define SPI1_NSS_PB4 \
	GD32_PINMUX_AF('B', 4, AF7)
#define SPI1_NSS_PB9 \
	GD32_PINMUX_AF('B', 9, AF5)
#define SPI1_NSS_PB12 \
	GD32_PINMUX_AF('B', 12, AF5)

/* SPI1_SCK */
#define SPI1_SCK_PA9 \
	GD32_PINMUX_AF('A', 9, AF5)
#define SPI1_SCK_PA14 \
	GD32_PINMUX_AF('A', 14, AF5)
#define SPI1_SCK_PB10 \
	GD32_PINMUX_AF('B', 10, AF5)
#define SPI1_SCK_PB13 \
	GD32_PINMUX_AF('B', 13, AF5)
#define SPI1_SCK_PD3 \
	GD32_PINMUX_AF('D', 3, AF5)

/* SPI2_MISO */
#define SPI2_MISO_PB4 \
	GD32_PINMUX_AF('B', 4, AF6)
#define SPI2_MISO_PC11 \
	GD32_PINMUX_AF('C', 11, AF6)

/* SPI2_MOSI */
#define SPI2_MOSI_PB2 \
	GD32_PINMUX_AF('B', 2, AF7)
#define SPI2_MOSI_PB5 \
	GD32_PINMUX_AF('B', 5, AF7)
#define SPI2_MOSI_PC12 \
	GD32_PINMUX_AF('C', 12, AF6)
#define SPI2_MOSI_PD6 \
	GD32_PINMUX_AF('D', 6, AF5)

/* SPI2_NSS */
#define SPI2_NSS_PA4 \
	GD32_PINMUX_AF('A', 4, AF6)
#define SPI2_NSS_PA15 \
	GD32_PINMUX_AF('A', 15, AF6)

/* SPI2_SCK */
#define SPI2_SCK_PB3 \
	GD32_PINMUX_AF('B', 3, AF6)
#define SPI2_SCK_PC10 \
	GD32_PINMUX_AF('C', 10, AF6)

/* SPI3_IO2 */
#define SPI3_IO2_PD14 \
	GD32_PINMUX_AF('D', 14, AF5)
#define SPI3_IO2_PE9 \
	GD32_PINMUX_AF('E', 9, AF5)

/* SPI3_IO3 */
#define SPI3_IO3_PD15 \
	GD32_PINMUX_AF('D', 15, AF5)
#define SPI3_IO3_PE10 \
	GD32_PINMUX_AF('E', 10, AF5)

/* SPI3_MISO */
#define SPI3_MISO_PE5 \
	GD32_PINMUX_AF('E', 5, AF5)
#define SPI3_MISO_PE13 \
	GD32_PINMUX_AF('E', 13, AF5)

/* SPI3_MOSI */
#define SPI3_MOSI_PE6 \
	GD32_PINMUX_AF('E', 6, AF5)
#define SPI3_MOSI_PE14 \
	GD32_PINMUX_AF('E', 14, AF5)

/* SPI3_NSS */
#define SPI3_NSS_PE4 \
	GD32_PINMUX_AF('E', 4, AF5)
#define SPI3_NSS_PE11 \
	GD32_PINMUX_AF('E', 11, AF5)

/* SPI3_SCK */
#define SPI3_SCK_PE2 \
	GD32_PINMUX_AF('E', 2, AF5)
#define SPI3_SCK_PE12 \
	GD32_PINMUX_AF('E', 12, AF5)

/* SPI4_IO2 */
#define SPI4_IO2_PF14 \
	GD32_PINMUX_AF('F', 14, AF5)
#define SPI4_IO2_PH8 \
	GD32_PINMUX_AF('H', 8, AF5)
#define SPI4_IO2_PJ8 \
	GD32_PINMUX_AF('J', 8, AF5)

/* SPI4_IO3 */
#define SPI4_IO3_PF15 \
	GD32_PINMUX_AF('F', 15, AF5)
#define SPI4_IO3_PH9 \
	GD32_PINMUX_AF('H', 9, AF5)
#define SPI4_IO3_PJ9 \
	GD32_PINMUX_AF('J', 9, AF5)

/* SPI4_MISO */
#define SPI4_MISO_PF8 \
	GD32_PINMUX_AF('F', 8, AF5)
#define SPI4_MISO_PH7 \
	GD32_PINMUX_AF('H', 7, AF5)
#define SPI4_MISO_PJ11 \
	GD32_PINMUX_AF('J', 11, AF5)

/* SPI4_MOSI */
#define SPI4_MOSI_PF9 \
	GD32_PINMUX_AF('F', 9, AF5)
#define SPI4_MOSI_PF11 \
	GD32_PINMUX_AF('F', 11, AF5)
#define SPI4_MOSI_PJ10 \
	GD32_PINMUX_AF('J', 10, AF5)

/* SPI4_NSS */
#define SPI4_NSS_PF6 \
	GD32_PINMUX_AF('F', 6, AF5)
#define SPI4_NSS_PH5 \
	GD32_PINMUX_AF('H', 5, AF5)
#define SPI4_NSS_PK1 \
	GD32_PINMUX_AF('K', 1, AF5)

/* SPI4_SCK */
#define SPI4_SCK_PF7 \
	GD32_PINMUX_AF('F', 7, AF5)
#define SPI4_SCK_PH6 \
	GD32_PINMUX_AF('H', 6, AF5)
#define SPI4_SCK_PK0 \
	GD32_PINMUX_AF('K', 0, AF5)

/* SPI5_MISO */
#define SPI5_MISO_PA6 \
	GD32_PINMUX_AF('A', 6, AF8)
#define SPI5_MISO_PB4 \
	GD32_PINMUX_AF('B', 4, AF8)
#define SPI5_MISO_PG12 \
	GD32_PINMUX_AF('G', 12, AF5)

/* SPI5_MOSI */
#define SPI5_MOSI_PA7 \
	GD32_PINMUX_AF('A', 7, AF8)
#define SPI5_MOSI_PB5 \
	GD32_PINMUX_AF('B', 5, AF8)
#define SPI5_MOSI_PG14 \
	GD32_PINMUX_AF('G', 14, AF5)

/* SPI5_NSS */
#define SPI5_NSS_PA0 \
	GD32_PINMUX_AF('A', 0, AF5)
#define SPI5_NSS_PA4 \
	GD32_PINMUX_AF('A', 4, AF8)
#define SPI5_NSS_PA15 \
	GD32_PINMUX_AF('A', 15, AF7)
#define SPI5_NSS_PG8 \
	GD32_PINMUX_AF('G', 8, AF5)

/* SPI5_SCK */
#define SPI5_SCK_PA5 \
	GD32_PINMUX_AF('A', 5, AF8)
#define SPI5_SCK_PB3 \
	GD32_PINMUX_AF('B', 3, AF8)
#define SPI5_SCK_PC12 \
	GD32_PINMUX_AF('C', 12, AF5)
#define SPI5_SCK_PG13 \
	GD32_PINMUX_AF('G', 13, AF5)

/* SWCLK */
#define SWCLK_PA14 \
	GD32_PINMUX_AF('A', 14, AF0)

/* SWDIO */
#define SWDIO_PA13 \
	GD32_PINMUX_AF('A', 13, AF0)

/* TIMER0_BRKIN0 */
#define TIMER0_BRKIN0_PA6 \
	GD32_PINMUX_AF('A', 6, AF1)
#define TIMER0_BRKIN0_PB12 \
	GD32_PINMUX_AF('B', 12, AF1)
#define TIMER0_BRKIN0_PE15 \
	GD32_PINMUX_AF('E', 15, AF1)
#define TIMER0_BRKIN0_PK2 \
	GD32_PINMUX_AF('K', 2, AF1)

/* TIMER0_BRKIN1 */
#define TIMER0_BRKIN1_PA13 \
	GD32_PINMUX_AF('A', 13, AF1)
#define TIMER0_BRKIN1_PC6 \
	GD32_PINMUX_AF('C', 6, AF1)
#define TIMER0_BRKIN1_PE4 \
	GD32_PINMUX_AF('E', 4, AF1)
#define TIMER0_BRKIN1_PG2 \
	GD32_PINMUX_AF('G', 2, AF1)

/* TIMER0_BRKIN2 */
#define TIMER0_BRKIN2_PA14 \
	GD32_PINMUX_AF('A', 14, AF12)
#define TIMER0_BRKIN2_PE6 \
	GD32_PINMUX_AF('E', 6, AF1)
#define TIMER0_BRKIN2_PG4 \
	GD32_PINMUX_AF('G', 4, AF1)

/* TIMER0_CH0 */
#define TIMER0_CH0_PA8 \
	GD32_PINMUX_AF('A', 8, AF1)
#define TIMER0_CH0_PE9 \
	GD32_PINMUX_AF('E', 9, AF1)
#define TIMER0_CH0_PK1 \
	GD32_PINMUX_AF('K', 1, AF1)

/* TIMER0_CH1 */
#define TIMER0_CH1_PA9 \
	GD32_PINMUX_AF('A', 9, AF1)
#define TIMER0_CH1_PE11 \
	GD32_PINMUX_AF('E', 11, AF1)
#define TIMER0_CH1_PJ11 \
	GD32_PINMUX_AF('J', 11, AF1)

/* TIMER0_CH2 */
#define TIMER0_CH2_PA10 \
	GD32_PINMUX_AF('A', 10, AF1)
#define TIMER0_CH2_PE13 \
	GD32_PINMUX_AF('E', 13, AF1)
#define TIMER0_CH2_PJ9 \
	GD32_PINMUX_AF('J', 9, AF1)

/* TIMER0_CH3 */
#define TIMER0_CH3_PC7 \
	GD32_PINMUX_AF('C', 7, AF1)
#define TIMER0_CH3_PC10 \
	GD32_PINMUX_AF('C', 10, AF1)
#define TIMER0_CH3_PE14 \
	GD32_PINMUX_AF('E', 14, AF1)

/* TIMER0_ETI */
#define TIMER0_ETI_PC11 \
	GD32_PINMUX_AF('C', 11, AF1)
#define TIMER0_ETI_PE7 \
	GD32_PINMUX_AF('E', 7, AF1)
#define TIMER0_ETI_PG5 \
	GD32_PINMUX_AF('G', 5, AF1)

/* TIMER0_MCH0 */
#define TIMER0_MCH0_PA7 \
	GD32_PINMUX_AF('A', 7, AF1)
#define TIMER0_MCH0_PB13 \
	GD32_PINMUX_AF('B', 13, AF1)
#define TIMER0_MCH0_PE8 \
	GD32_PINMUX_AF('E', 8, AF1)
#define TIMER0_MCH0_PK0 \
	GD32_PINMUX_AF('K', 0, AF1)

