GD32-MCU-IOT/hal_gigadevice_zephyr/include/dt-bindings/pinctrl/gd32h759i(g-i-m)xx-pinctrl.h
/* TIMER0_MCH1 */
#define TIMER0_MCH1_PB0 \
	GD32_PINMUX_AF('B', 0, AF1)
#define TIMER0_MCH1_PE10 \
	GD32_PINMUX_AF('E', 10, AF1)
#define TIMER0_MCH1_PF4 \
	GD32_PINMUX_AF('F', 4, AF1)
#define TIMER0_MCH1_PJ10 \
	GD32_PINMUX_AF('J', 10, AF1)

/* TIMER0_MCH2 */
#define TIMER0_MCH2_PB1 \
	GD32_PINMUX_AF('B', 1, AF1)
#define TIMER0_MCH2_PE12 \
	GD32_PINMUX_AF('E', 12, AF1)
#define TIMER0_MCH2_PF5 \
	GD32_PINMUX_AF('F', 5, AF1)
#define TIMER0_MCH2_PJ8 \
	GD32_PINMUX_AF('J', 8, AF1)

/* TIMER0_MCH3 */
#define TIMER0_MCH3_PC9 \
	GD32_PINMUX_AF('C', 9, AF1)

/* TIMER14_BRKIN0 */
#define TIMER14_BRKIN0_PA0 \
	GD32_PINMUX_AF('A', 0, AF4)
#define TIMER14_BRKIN0_PD2 \
	GD32_PINMUX_AF('D', 2, AF4)
#define TIMER14_BRKIN0_PE3 \
	GD32_PINMUX_AF('E', 3, AF4)

/* TIMER14_CH0 */
#define TIMER14_CH0_PA2 \
	GD32_PINMUX_AF('A', 2, AF4)
#define TIMER14_CH0_PC12 \
	GD32_PINMUX_AF('C', 12, AF2)
#define TIMER14_CH0_PE5 \
	GD32_PINMUX_AF('E', 5, AF4)

/* TIMER14_CH1 */
#define TIMER14_CH1_PA3 \
	GD32_PINMUX_AF('A', 3, AF4)
#define TIMER14_CH1_PE6 \
	GD32_PINMUX_AF('E', 6, AF4)

/* TIMER14_MCH0 */
#define TIMER14_MCH0_PA1 \
	GD32_PINMUX_AF('A', 1, AF4)
#define TIMER14_MCH0_PE4 \
	GD32_PINMUX_AF('E', 4, AF4)

/* TIMER15_BRKIN0 */
#define TIMER15_BRKIN0_PB4 \
	GD32_PINMUX_AF('B', 4, AF1)
#define TIMER15_BRKIN0_PF10 \
	GD32_PINMUX_AF('F', 10, AF1)

/* TIMER15_CH0 */
#define TIMER15_CH0_PB8 \
	GD32_PINMUX_AF('B', 8, AF1)
#define TIMER15_CH0_PF6 \
	GD32_PINMUX_AF('F', 6, AF1)

/* TIMER15_MCH0 */
#define TIMER15_MCH0_PB6 \
	GD32_PINMUX_AF('B', 6, AF1)
#define TIMER15_MCH0_PF8 \
	GD32_PINMUX_AF('F', 8, AF1)

/* TIMER16_BRKIN0 */
#define TIMER16_BRKIN0_PB5 \
	GD32_PINMUX_AF('B', 5, AF1)
#define TIMER16_BRKIN0_PG6 \
	GD32_PINMUX_AF('G', 6, AF1)

/* TIMER16_CH0 */
#define TIMER16_CH0_PB9 \
	GD32_PINMUX_AF('B', 9, AF1)
#define TIMER16_CH0_PF7 \
	GD32_PINMUX_AF('F', 7, AF1)

/* TIMER16_MCH0 */
#define TIMER16_MCH0_PB7 \
	GD32_PINMUX_AF('B', 7, AF1)
#define TIMER16_MCH0_PF9 \
	GD32_PINMUX_AF('F', 9, AF1)

/* TIMER1_CH0 */
#define TIMER1_CH0_PA0 \
	GD32_PINMUX_AF('A', 0, AF1)
#define TIMER1_CH0_PA5 \
	GD32_PINMUX_AF('A', 5, AF1)
#define TIMER1_CH0_PA15 \
	GD32_PINMUX_AF('A', 15, AF1)

/* TIMER1_CH1 */
#define TIMER1_CH1_PA1 \
	GD32_PINMUX_AF('A', 1, AF1)
#define TIMER1_CH1_PB3 \
	GD32_PINMUX_AF('B', 3, AF1)

/* TIMER1_CH2 */
#define TIMER1_CH2_PA2 \
	GD32_PINMUX_AF('A', 2, AF1)
#define TIMER1_CH2_PB10 \
	GD32_PINMUX_AF('B', 10, AF1)

/* TIMER1_CH3 */
#define TIMER1_CH3_PA3 \
	GD32_PINMUX_AF('A', 3, AF1)
#define TIMER1_CH3_PB11 \
	GD32_PINMUX_AF('B', 11, AF1)

/* TIMER1_ETI */
#define TIMER1_ETI_PA0 \
	GD32_PINMUX_AF('A', 0, AF1)
#define TIMER1_ETI_PA5 \
	GD32_PINMUX_AF('A', 5, AF1)
#define TIMER1_ETI_PA15 \
	GD32_PINMUX_AF('A', 15, AF1)

/* TIMER22_CH0 */
#define TIMER22_CH0_PF0 \
	GD32_PINMUX_AF('F', 0, AF13)
#define TIMER22_CH0_PF6 \
	GD32_PINMUX_AF('F', 6, AF13)
#define TIMER22_CH0_PG12 \
	GD32_PINMUX_AF('G', 12, AF13)

/* TIMER22_CH1 */
#define TIMER22_CH1_PF1 \
	GD32_PINMUX_AF('F', 1, AF13)
#define TIMER22_CH1_PF7 \
	GD32_PINMUX_AF('F', 7, AF13)
#define TIMER22_CH1_PG13 \
	GD32_PINMUX_AF('G', 13, AF13)

/* TIMER22_CH2 */
#define TIMER22_CH2_PF2 \
	GD32_PINMUX_AF('F', 2, AF13)
#define TIMER22_CH2_PF8 \
	GD32_PINMUX_AF('F', 8, AF13)
#define TIMER22_CH2_PG14 \
	GD32_PINMUX_AF('G', 14, AF13)

/* TIMER22_CH3 */
#define TIMER22_CH3_PF3 \
	GD32_PINMUX_AF('F', 3, AF13)
#define TIMER22_CH3_PF9 \
	GD32_PINMUX_AF('F', 9, AF13)

/* TIMER22_ETI */
#define TIMER22_ETI_PB2 \
	GD32_PINMUX_AF('B', 2, AF13)
#define TIMER22_ETI_PG3 \
	GD32_PINMUX_AF('G', 3, AF13)

/* TIMER23_CH0 */
#define TIMER23_CH0_PF11 \
	GD32_PINMUX_AF('F', 11, AF14)

/* TIMER23_CH1 */
#define TIMER23_CH1_PF12 \
	GD32_PINMUX_AF('F', 12, AF14)

/* TIMER23_CH2 */
#define TIMER23_CH2_PF13 \
	GD32_PINMUX_AF('F', 13, AF14)

/* TIMER23_CH3 */
#define TIMER23_CH3_PF14 \
	GD32_PINMUX_AF('F', 14, AF14)

/* TIMER23_ETI */
#define TIMER23_ETI_PB3 \
	GD32_PINMUX_AF('B', 3, AF14)
#define TIMER23_ETI_PG2 \
	GD32_PINMUX_AF('G', 2, AF14)

/* TIMER2_CH0 */
#define TIMER2_CH0_PA6 \
	GD32_PINMUX_AF('A', 6, AF2)
#define TIMER2_CH0_PB4 \
	GD32_PINMUX_AF('B', 4, AF2)
#define TIMER2_CH0_PC6 \
	GD32_PINMUX_AF('C', 6, AF2)

/* TIMER2_CH1 */
#define TIMER2_CH1_PA7 \
	GD32_PINMUX_AF('A', 7, AF2)
#define TIMER2_CH1_PB5 \
	GD32_PINMUX_AF('B', 5, AF2)
#define TIMER2_CH1_PC7 \
	GD32_PINMUX_AF('C', 7, AF2)

/* TIMER2_CH2 */
#define TIMER2_CH2_PB0 \
	GD32_PINMUX_AF('B', 0, AF2)
#define TIMER2_CH2_PC8 \
	GD32_PINMUX_AF('C', 8, AF2)

/* TIMER2_CH3 */
#define TIMER2_CH3_PB1 \
	GD32_PINMUX_AF('B', 1, AF2)
#define TIMER2_CH3_PC9 \
	GD32_PINMUX_AF('C', 9, AF2)

/* TIMER2_ETI */
#define TIMER2_ETI_PD2 \
	GD32_PINMUX_AF('D', 2, AF2)

/* TIMER30_CH0 */
#define TIMER30_CH0_PG5 \
	GD32_PINMUX_AF('G', 5, AF4)

/* TIMER30_CH1 */
#define TIMER30_CH1_PG6 \
	GD32_PINMUX_AF('G', 6, AF4)

/* TIMER30_CH2 */
#define TIMER30_CH2_PG7 \
	GD32_PINMUX_AF('G', 7, AF4)

/* TIMER30_CH3 */
#define TIMER30_CH3_PG8 \
	GD32_PINMUX_AF('G', 8, AF4)

/* TIMER30_ETI */
#define TIMER30_ETI_PG9 \
	GD32_PINMUX_AF('G', 9, AF4)

/* TIMER31_CH0 */
#define TIMER31_CH0_PG0 \
	GD32_PINMUX_AF('G', 0, AF4)

/* TIMER31_CH1 */
#define TIMER31_CH1_PG1 \
	GD32_PINMUX_AF('G', 1, AF4)

/* TIMER31_CH2 */
#define TIMER31_CH2_PG2 \
	GD32_PINMUX_AF('G', 2, AF4)

/* TIMER31_CH3 */
#define TIMER31_CH3_PG3 \
	GD32_PINMUX_AF('G', 3, AF4)

/* TIMER31_ETI */
#define TIMER31_ETI_PG4 \
	GD32_PINMUX_AF('G', 4, AF4)

/* TIMER3_CH0 */
#define TIMER3_CH0_PB6 \
	GD32_PINMUX_AF('B', 6, AF2)
#define TIMER3_CH0_PD12 \
	GD32_PINMUX_AF('D', 12, AF2)

/* TIMER3_CH1 */
#define TIMER3_CH1_PB7 \
	GD32_PINMUX_AF('B', 7, AF2)
#define TIMER3_CH1_PD13 \
	GD32_PINMUX_AF('D', 13, AF2)

/* TIMER3_CH2 */
#define TIMER3_CH2_PB8 \
	GD32_PINMUX_AF('B', 8, AF2)
#define TIMER3_CH2_PD14 \
	GD32_PINMUX_AF('D', 14, AF2)

/* TIMER3_CH3 */
#define TIMER3_CH3_PB9 \
	GD32_PINMUX_AF('B', 9, AF2)
#define TIMER3_CH3_PD15 \
	GD32_PINMUX_AF('D', 15, AF2)

/* TIMER3_ETI */
#define TIMER3_ETI_PE0 \
	GD32_PINMUX_AF('E', 0, AF2)

/* TIMER40_BRKIN0 */
#define TIMER40_BRKIN0_PH4 \
	GD32_PINMUX_AF('H', 4, AF7)

/* TIMER40_CH0 */
#define TIMER40_CH0_PC0 \
	GD32_PINMUX_AF('C', 0, AF7)
#define TIMER40_CH0_PH2 \
	GD32_PINMUX_AF('H', 2, AF7)

