GD32-MCU-IOT/hal_gigadevice_zephyr/include/dt-bindings/pinctrl/gd32h759i(g-i-m)xx-pinctrl.h
/* TIMER40_CH1 */
#define TIMER40_CH1_PD11 \
	GD32_PINMUX_AF('D', 11, AF0)

/* TIMER40_MCH0 */
#define TIMER40_MCH0_PC1 \
	GD32_PINMUX_AF('C', 1, AF7)
#define TIMER40_MCH0_PH3 \
	GD32_PINMUX_AF('H', 3, AF7)

/* TIMER41_BRKIN0 */
#define TIMER41_BRKIN0_PH7 \
	GD32_PINMUX_AF('H', 7, AF7)

/* TIMER41_CH0 */
#define TIMER41_CH0_PC4 \
	GD32_PINMUX_AF('C', 4, AF7)
#define TIMER41_CH0_PH5 \
	GD32_PINMUX_AF('H', 5, AF7)

/* TIMER41_CH1 */
#define TIMER41_CH1_PD12 \
	GD32_PINMUX_AF('D', 12, AF0)

/* TIMER41_MCH0 */
#define TIMER41_MCH0_PC5 \
	GD32_PINMUX_AF('C', 5, AF7)
#define TIMER41_MCH0_PH6 \
	GD32_PINMUX_AF('H', 6, AF7)

/* TIMER42_BRKIN0 */
#define TIMER42_BRKIN0_PH10 \
	GD32_PINMUX_AF('H', 10, AF7)

/* TIMER42_CH0 */
#define TIMER42_CH0_PH8 \
	GD32_PINMUX_AF('H', 8, AF7)

/* TIMER42_CH1 */
#define TIMER42_CH1_PD13 \
	GD32_PINMUX_AF('D', 13, AF0)

/* TIMER42_MCH0 */
#define TIMER42_MCH0_PH9 \
	GD32_PINMUX_AF('H', 9, AF7)

/* TIMER43_BRKIN0 */
#define TIMER43_BRKIN0_PH13 \
	GD32_PINMUX_AF('H', 13, AF7)

/* TIMER43_CH0 */
#define TIMER43_CH0_PH11 \
	GD32_PINMUX_AF('H', 11, AF7)

/* TIMER43_CH1 */
#define TIMER43_CH1_PD14 \
	GD32_PINMUX_AF('D', 14, AF0)

/* TIMER43_MCH0 */
#define TIMER43_MCH0_PH12 \
	GD32_PINMUX_AF('H', 12, AF7)

/* TIMER44_BRKIN0 */
#define TIMER44_BRKIN0_PG15 \
	GD32_PINMUX_AF('G', 15, AF8)

/* TIMER44_CH0 */
#define TIMER44_CH0_PG13 \
	GD32_PINMUX_AF('G', 13, AF8)

/* TIMER44_CH1 */
#define TIMER44_CH1_PD15 \
	GD32_PINMUX_AF('D', 15, AF0)

/* TIMER44_MCH0 */
#define TIMER44_MCH0_PG14 \
	GD32_PINMUX_AF('G', 14, AF8)

/* TIMER4_CH0 */
#define TIMER4_CH0_PA0 \
	GD32_PINMUX_AF('A', 0, AF2)
#define TIMER4_CH0_PH10 \
	GD32_PINMUX_AF('H', 10, AF2)

/* TIMER4_CH1 */
#define TIMER4_CH1_PA1 \
	GD32_PINMUX_AF('A', 1, AF2)
#define TIMER4_CH1_PH11 \
	GD32_PINMUX_AF('H', 11, AF2)

/* TIMER4_CH2 */
#define TIMER4_CH2_PA2 \
	GD32_PINMUX_AF('A', 2, AF2)
#define TIMER4_CH2_PH12 \
	GD32_PINMUX_AF('H', 12, AF2)

/* TIMER4_CH3 */
#define TIMER4_CH3_PA3 \
	GD32_PINMUX_AF('A', 3, AF2)

/* TIMER4_ETI */
#define TIMER4_ETI_PA4 \
	GD32_PINMUX_AF('A', 4, AF2)
#define TIMER4_ETI_PH8 \
	GD32_PINMUX_AF('H', 8, AF2)

/* TIMER7_BRKIN0 */
#define TIMER7_BRKIN0_PA6 \
	GD32_PINMUX_AF('A', 6, AF3)
#define TIMER7_BRKIN0_PG2 \
	GD32_PINMUX_AF('G', 2, AF3)
#define TIMER7_BRKIN0_PK2 \
	GD32_PINMUX_AF('K', 2, AF3)

/* TIMER7_BRKIN1 */
#define TIMER7_BRKIN1_PA13 \
	GD32_PINMUX_AF('A', 13, AF3)
#define TIMER7_BRKIN1_PG4 \
	GD32_PINMUX_AF('G', 4, AF3)
#define TIMER7_BRKIN1_PG9 \
	GD32_PINMUX_AF('G', 9, AF3)

/* TIMER7_BRKIN2 */
#define TIMER7_BRKIN2_PA8 \
	GD32_PINMUX_AF('A', 8, AF3)
#define TIMER7_BRKIN2_PG3 \
	GD32_PINMUX_AF('G', 3, AF3)

/* TIMER7_CH0 */
#define TIMER7_CH0_PC6 \
	GD32_PINMUX_AF('C', 6, AF3)
#define TIMER7_CH0_PJ8 \
	GD32_PINMUX_AF('J', 8, AF3)

/* TIMER7_CH1 */
#define TIMER7_CH1_PC7 \
	GD32_PINMUX_AF('C', 7, AF3)
#define TIMER7_CH1_PJ10 \
	GD32_PINMUX_AF('J', 10, AF3)

/* TIMER7_CH2 */
#define TIMER7_CH2_PC8 \
	GD32_PINMUX_AF('C', 8, AF3)
#define TIMER7_CH2_PD0 \
	GD32_PINMUX_AF('D', 0, AF2)
#define TIMER7_CH2_PK0 \
	GD32_PINMUX_AF('K', 0, AF3)

/* TIMER7_CH3 */
#define TIMER7_CH3_PC9 \
	GD32_PINMUX_AF('C', 9, AF3)
#define TIMER7_CH3_PD5 \
	GD32_PINMUX_AF('D', 5, AF3)

/* TIMER7_ETI */
#define TIMER7_ETI_PA0 \
	GD32_PINMUX_AF('A', 0, AF3)
#define TIMER7_ETI_PG8 \
	GD32_PINMUX_AF('G', 8, AF3)

/* TIMER7_MCH0 */
#define TIMER7_MCH0_PA5 \
	GD32_PINMUX_AF('A', 5, AF3)
#define TIMER7_MCH0_PA7 \
	GD32_PINMUX_AF('A', 7, AF3)
#define TIMER7_MCH0_PH13 \
	GD32_PINMUX_AF('H', 13, AF3)
#define TIMER7_MCH0_PJ9 \
	GD32_PINMUX_AF('J', 9, AF3)

/* TIMER7_MCH1 */
#define TIMER7_MCH1_PB0 \
	GD32_PINMUX_AF('B', 0, AF3)
#define TIMER7_MCH1_PF4 \
	GD32_PINMUX_AF('F', 4, AF3)
#define TIMER7_MCH1_PH14 \
	GD32_PINMUX_AF('H', 14, AF3)
#define TIMER7_MCH1_PJ11 \
	GD32_PINMUX_AF('J', 11, AF3)

/* TIMER7_MCH2 */
#define TIMER7_MCH2_PB1 \
	GD32_PINMUX_AF('B', 1, AF3)
#define TIMER7_MCH2_PF5 \
	GD32_PINMUX_AF('F', 5, AF3)
#define TIMER7_MCH2_PH15 \
	GD32_PINMUX_AF('H', 15, AF3)
#define TIMER7_MCH2_PK1 \
	GD32_PINMUX_AF('K', 1, AF3)

/* TIMER7_MCH3 */
#define TIMER7_MCH3_PD4 \
	GD32_PINMUX_AF('D', 4, AF3)
#define TIMER7_MCH3_PD11 \
	GD32_PINMUX_AF('D', 11, AF3)

/* TLI_B0 */
#define TLI_B0_PE4 \
	GD32_PINMUX_AF('E', 4, AF14)
#define TLI_B0_PG14 \
	GD32_PINMUX_AF('G', 14, AF14)

/* TLI_B1 */
#define TLI_B1_PA10 \
	GD32_PINMUX_AF('A', 10, AF14)
#define TLI_B1_PC10 \
	GD32_PINMUX_AF('C', 10, AF10)
#define TLI_B1_PD0 \
	GD32_PINMUX_AF('D', 0, AF14)
#define TLI_B1_PG12 \
	GD32_PINMUX_AF('G', 12, AF14)

/* TLI_B2 */
#define TLI_B2_PA3 \
	GD32_PINMUX_AF('A', 3, AF9)
#define TLI_B2_PC9 \
	GD32_PINMUX_AF('C', 9, AF14)
#define TLI_B2_PD2 \
	GD32_PINMUX_AF('D', 2, AF14)
#define TLI_B2_PD6 \
	GD32_PINMUX_AF('D', 6, AF14)
#define TLI_B2_PG10 \
	GD32_PINMUX_AF('G', 10, AF14)

/* TLI_B3 */
#define TLI_B3_PA8 \
	GD32_PINMUX_AF('A', 8, AF13)
#define TLI_B3_PD10 \
	GD32_PINMUX_AF('D', 10, AF14)
#define TLI_B3_PG11 \
	GD32_PINMUX_AF('G', 11, AF14)

/* TLI_B4 */
#define TLI_B4_PA10 \
	GD32_PINMUX_AF('A', 10, AF12)
#define TLI_B4_PC11 \
	GD32_PINMUX_AF('C', 11, AF14)
#define TLI_B4_PE12 \
	GD32_PINMUX_AF('E', 12, AF14)
#define TLI_B4_PG12 \
	GD32_PINMUX_AF('G', 12, AF9)

/* TLI_B5 */
#define TLI_B5_PA3 \
	GD32_PINMUX_AF('A', 3, AF14)
#define TLI_B5_PB5 \
	GD32_PINMUX_AF('B', 5, AF3)

/* TLI_B6 */
#define TLI_B6_PA15 \
	GD32_PINMUX_AF('A', 15, AF14)
#define TLI_B6_PB8 \
	GD32_PINMUX_AF('B', 8, AF14)

/* TLI_B7 */
#define TLI_B7_PB9 \
	GD32_PINMUX_AF('B', 9, AF14)
#define TLI_B7_PD2 \
	GD32_PINMUX_AF('D', 2, AF9)

/* TLI_DE */
#define TLI_DE_PC5 \
	GD32_PINMUX_AF('C', 5, AF14)
#define TLI_DE_PE13 \
	GD32_PINMUX_AF('E', 13, AF14)
#define TLI_DE_PF10 \
	GD32_PINMUX_AF('F', 10, AF14)

/* TLI_G0 */
#define TLI_G0_PB1 \
	GD32_PINMUX_AF('B', 1, AF14)
#define TLI_G0_PE5 \
	GD32_PINMUX_AF('E', 5, AF14)

/* TLI_G1 */
#define TLI_G1_PB0 \
	GD32_PINMUX_AF('B', 0, AF14)
#define TLI_G1_PE6 \
	GD32_PINMUX_AF('E', 6, AF14)
#define TLI_G1_PJ8 \
	GD32_PINMUX_AF('J', 8, AF14)

/* TLI_G2 */
#define TLI_G2_PA6 \
	GD32_PINMUX_AF('A', 6, AF14)
#define TLI_G2_PC0 \
	GD32_PINMUX_AF('C', 0, AF11)
#define TLI_G2_PH13 \
	GD32_PINMUX_AF('H', 13, AF14)
#define TLI_G2_PJ9 \
	GD32_PINMUX_AF('J', 9, AF14)

/* TLI_G3 */
#define TLI_G3_PC9 \
	GD32_PINMUX_AF('C', 9, AF10)
#define TLI_G3_PE11 \
	GD32_PINMUX_AF('E', 11, AF14)
#define TLI_G3_PG10 \
	GD32_PINMUX_AF('G', 10, AF9)
#define TLI_G3_PH3 \
	GD32_PINMUX_AF('H', 3, AF13)
#define TLI_G3_PH14 \
	GD32_PINMUX_AF('H', 14, AF14)
#define TLI_G3_PJ10 \
	GD32_PINMUX_AF('J', 10, AF14)

/* TLI_G4 */
#define TLI_G4_PB10 \
	GD32_PINMUX_AF('B', 10, AF14)
#define TLI_G4_PH4 \
	GD32_PINMUX_AF('H', 4, AF14)
#define TLI_G4_PH15 \
	GD32_PINMUX_AF('H', 15, AF14)
#define TLI_G4_PJ11 \
	GD32_PINMUX_AF('J', 11, AF14)

/* TLI_G5 */
#define TLI_G5_PB11 \
	GD32_PINMUX_AF('B', 11, AF14)
#define TLI_G5_PC1 \
	GD32_PINMUX_AF('C', 1, AF14)
#define TLI_G5_PH4 \
	GD32_PINMUX_AF('H', 4, AF9)
#define TLI_G5_PK0 \
	GD32_PINMUX_AF('K', 0, AF14)

