GD32-MCU-IOT/hal_gigadevice_zephyr/include/dt-bindings/pinctrl/gd32h759i(g-i-m)xx-pinctrl.h
/* TLI_G6 */
#define TLI_G6_PC7 \
	GD32_PINMUX_AF('C', 7, AF14)
#define TLI_G6_PK1 \
	GD32_PINMUX_AF('K', 1, AF14)

/* TLI_G7 */
#define TLI_G7_PA14 \
	GD32_PINMUX_AF('A', 14, AF4)
#define TLI_G7_PD3 \
	GD32_PINMUX_AF('D', 3, AF14)
#define TLI_G7_PF5 \
	GD32_PINMUX_AF('F', 5, AF14)
#define TLI_G7_PG8 \
	GD32_PINMUX_AF('G', 8, AF14)
#define TLI_G7_PK2 \
	GD32_PINMUX_AF('K', 2, AF14)

/* TLI_HSYNC */
#define TLI_HSYNC_PC6 \
	GD32_PINMUX_AF('C', 6, AF14)
#define TLI_HSYNC_PE15 \
	GD32_PINMUX_AF('E', 15, AF10)

/* TLI_PIXCLK */
#define TLI_PIXCLK_PB3 \
	GD32_PINMUX_AF('B', 3, AF2)
#define TLI_PIXCLK_PE14 \
	GD32_PINMUX_AF('E', 14, AF14)
#define TLI_PIXCLK_PF4 \
	GD32_PINMUX_AF('F', 4, AF14)
#define TLI_PIXCLK_PG7 \
	GD32_PINMUX_AF('G', 7, AF14)

/* TLI_R0 */
#define TLI_R0_PE0 \
	GD32_PINMUX_AF('E', 0, AF14)
#define TLI_R0_PG13 \
	GD32_PINMUX_AF('G', 13, AF14)
#define TLI_R0_PH2 \
	GD32_PINMUX_AF('H', 2, AF14)

/* TLI_R1 */
#define TLI_R1_PA2 \
	GD32_PINMUX_AF('A', 2, AF14)
#define TLI_R1_PH3 \
	GD32_PINMUX_AF('H', 3, AF14)

/* TLI_R2 */
#define TLI_R2_PA1 \
	GD32_PINMUX_AF('A', 1, AF14)
#define TLI_R2_PC10 \
	GD32_PINMUX_AF('C', 10, AF14)
#define TLI_R2_PH8 \
	GD32_PINMUX_AF('H', 8, AF14)

/* TLI_R3 */
#define TLI_R3_PA15 \
	GD32_PINMUX_AF('A', 15, AF9)
#define TLI_R3_PB0 \
	GD32_PINMUX_AF('B', 0, AF9)
#define TLI_R3_PH9 \
	GD32_PINMUX_AF('H', 9, AF14)

/* TLI_R4 */
#define TLI_R4_PA5 \
	GD32_PINMUX_AF('A', 5, AF14)
#define TLI_R4_PA13 \
	GD32_PINMUX_AF('A', 13, AF14)
#define TLI_R4_PH10 \
	GD32_PINMUX_AF('H', 10, AF14)

/* TLI_R5 */
#define TLI_R5_PA9 \
	GD32_PINMUX_AF('A', 9, AF14)
#define TLI_R5_PA14 \
	GD32_PINMUX_AF('A', 14, AF14)
#define TLI_R5_PC0 \
	GD32_PINMUX_AF('C', 0, AF14)
#define TLI_R5_PH11 \
	GD32_PINMUX_AF('H', 11, AF14)

/* TLI_R6 */
#define TLI_R6_PA8 \
	GD32_PINMUX_AF('A', 8, AF14)
#define TLI_R6_PB1 \
	GD32_PINMUX_AF('B', 1, AF9)
#define TLI_R6_PC12 \
	GD32_PINMUX_AF('C', 12, AF14)
#define TLI_R6_PE1 \
	GD32_PINMUX_AF('E', 1, AF14)
#define TLI_R6_PH12 \
	GD32_PINMUX_AF('H', 12, AF14)

/* TLI_R7 */
#define TLI_R7_PC4 \
	GD32_PINMUX_AF('C', 4, AF14)
#define TLI_R7_PE15 \
	GD32_PINMUX_AF('E', 15, AF14)
#define TLI_R7_PG6 \
	GD32_PINMUX_AF('G', 6, AF14)

/* TLI_VSYNC */
#define TLI_VSYNC_PA4 \
	GD32_PINMUX_AF('A', 4, AF14)
#define TLI_VSYNC_PA7 \
	GD32_PINMUX_AF('A', 7, AF14)

/* TRACECK */
#define TRACECK_PE2 \
	GD32_PINMUX_AF('E', 2, AF0)

/* TRACED0 */
#define TRACED0_PC1 \
	GD32_PINMUX_AF('C', 1, AF0)
#define TRACED0_PE3 \
	GD32_PINMUX_AF('E', 3, AF0)
#define TRACED0_PG13 \
	GD32_PINMUX_AF('G', 13, AF0)

/* TRACED1 */
#define TRACED1_PC8 \
	GD32_PINMUX_AF('C', 8, AF0)
#define TRACED1_PE4 \
	GD32_PINMUX_AF('E', 4, AF0)
#define TRACED1_PG14 \
	GD32_PINMUX_AF('G', 14, AF0)

/* TRACED2 */
#define TRACED2_PD2 \
	GD32_PINMUX_AF('D', 2, AF0)
#define TRACED2_PE5 \
	GD32_PINMUX_AF('E', 5, AF0)

/* TRACED3 */
#define TRACED3_PC12 \
	GD32_PINMUX_AF('C', 12, AF0)
#define TRACED3_PE6 \
	GD32_PINMUX_AF('E', 6, AF0)

/* TRACESWO */
#define TRACESWO_PB3 \
	GD32_PINMUX_AF('B', 3, AF0)

/* TRIGSEL_IN0 */
#define TRIGSEL_IN0_PA0 \
	GD32_PINMUX_AF('A', 0, AF13)

/* TRIGSEL_IN1 */
#define TRIGSEL_IN1_PA1 \
	GD32_PINMUX_AF('A', 1, AF13)

/* TRIGSEL_IN10 */
#define TRIGSEL_IN10_PA13 \
	GD32_PINMUX_AF('A', 13, AF13)

/* TRIGSEL_IN11 */
#define TRIGSEL_IN11_PA14 \
	GD32_PINMUX_AF('A', 14, AF13)

/* TRIGSEL_IN12 */
#define TRIGSEL_IN12_PA10 \
	GD32_PINMUX_AF('A', 10, AF9)

/* TRIGSEL_IN13 */
#define TRIGSEL_IN13_PA9 \
	GD32_PINMUX_AF('A', 9, AF9)

/* TRIGSEL_IN2 */
#define TRIGSEL_IN2_PC2 \
	GD32_PINMUX_AF('C', 2, AF13)

/* TRIGSEL_IN3 */
#define TRIGSEL_IN3_PD0 \
	GD32_PINMUX_AF('D', 0, AF13)

/* TRIGSEL_IN4 */
#define TRIGSEL_IN4_PA3 \
	GD32_PINMUX_AF('A', 3, AF13)

/* TRIGSEL_IN5 */
#define TRIGSEL_IN5_PA7 \
	GD32_PINMUX_AF('A', 7, AF13)

/* TRIGSEL_IN6 */
#define TRIGSEL_IN6_PD1 \
	GD32_PINMUX_AF('D', 1, AF13)

/* TRIGSEL_IN7 */
#define TRIGSEL_IN7_PA2 \
	GD32_PINMUX_AF('A', 2, AF13)

/* TRIGSEL_IN8 */
#define TRIGSEL_IN8_PC0 \
	GD32_PINMUX_AF('C', 0, AF13)

/* TRIGSEL_IN9 */
#define TRIGSEL_IN9_PC1 \
	GD32_PINMUX_AF('C', 1, AF13)

/* TRIGSEL_OUT0 */
#define TRIGSEL_OUT0_PA15 \
	GD32_PINMUX_AF('A', 15, AF13)

/* TRIGSEL_OUT1 */
#define TRIGSEL_OUT1_PF4 \
	GD32_PINMUX_AF('F', 4, AF13)

/* TRIGSEL_OUT2 */
#define TRIGSEL_OUT2_PB10 \
	GD32_PINMUX_AF('B', 10, AF13)

/* TRIGSEL_OUT3 */
#define TRIGSEL_OUT3_PB0 \
	GD32_PINMUX_AF('B', 0, AF13)

/* TRIGSEL_OUT4 */
#define TRIGSEL_OUT4_PB1 \
	GD32_PINMUX_AF('B', 1, AF13)

/* TRIGSEL_OUT5 */
#define TRIGSEL_OUT5_PF5 \
	GD32_PINMUX_AF('F', 5, AF13)

/* TRIGSEL_OUT6 */
#define TRIGSEL_OUT6_PB4 \
	GD32_PINMUX_AF('B', 4, AF13)

/* TRIGSEL_OUT7 */
#define TRIGSEL_OUT7_PB3 \
	GD32_PINMUX_AF('B', 3, AF13)

/* UART3_CTS */
#define UART3_CTS_PB0 \
	GD32_PINMUX_AF('B', 0, AF8)
#define UART3_CTS_PF5 \
	GD32_PINMUX_AF('F', 5, AF8)

/* UART3_DE */
#define UART3_DE_PA15 \
	GD32_PINMUX_AF('A', 15, AF8)
#define UART3_DE_PF4 \
	GD32_PINMUX_AF('F', 4, AF8)

/* UART3_RTS */
#define UART3_RTS_PA15 \
	GD32_PINMUX_AF('A', 15, AF8)
#define UART3_RTS_PF4 \
	GD32_PINMUX_AF('F', 4, AF8)

/* UART3_RX */
#define UART3_RX_PA1 \
	GD32_PINMUX_AF('A', 1, AF8)
#define UART3_RX_PA13 \
	GD32_PINMUX_AF('A', 13, AF6)
#define UART3_RX_PB8 \
	GD32_PINMUX_AF('B', 8, AF8)
#define UART3_RX_PC11 \
	GD32_PINMUX_AF('C', 11, AF8)
#define UART3_RX_PD0 \
	GD32_PINMUX_AF('D', 0, AF8)
#define UART3_RX_PH14 \
	GD32_PINMUX_AF('H', 14, AF8)

/* UART3_TX */
#define UART3_TX_PA0 \
	GD32_PINMUX_AF('A', 0, AF8)
#define UART3_TX_PA14 \
	GD32_PINMUX_AF('A', 14, AF6)
#define UART3_TX_PB9 \
	GD32_PINMUX_AF('B', 9, AF8)
#define UART3_TX_PC10 \
	GD32_PINMUX_AF('C', 10, AF8)
#define UART3_TX_PD1 \
	GD32_PINMUX_AF('D', 1, AF8)
#define UART3_TX_PH13 \
	GD32_PINMUX_AF('H', 13, AF8)

/* UART4_CTS */
#define UART4_CTS_PC9 \
	GD32_PINMUX_AF('C', 9, AF8)

/* UART4_DE */
#define UART4_DE_PC8 \
	GD32_PINMUX_AF('C', 8, AF8)

/* UART4_RTS */
#define UART4_RTS_PC8 \
	GD32_PINMUX_AF('C', 8, AF8)

/* UART4_RX */
#define UART4_RX_PB5 \
	GD32_PINMUX_AF('B', 5, AF14)
#define UART4_RX_PB12 \
	GD32_PINMUX_AF('B', 12, AF14)
#define UART4_RX_PD2 \
	GD32_PINMUX_AF('D', 2, AF8)

/* UART4_TX */
#define UART4_TX_PB6 \
	GD32_PINMUX_AF('B', 6, AF14)
#define UART4_TX_PB13 \
	GD32_PINMUX_AF('B', 13, AF14)
#define UART4_TX_PC12 \
	GD32_PINMUX_AF('C', 12, AF8)

/* UART6_CTS */
#define UART6_CTS_PE10 \
	GD32_PINMUX_AF('E', 10, AF7)
#define UART6_CTS_PF9 \
	GD32_PINMUX_AF('F', 9, AF7)

/* UART6_DE */
#define UART6_DE_PE9 \
	GD32_PINMUX_AF('E', 9, AF7)
#define UART6_DE_PF8 \
	GD32_PINMUX_AF('F', 8, AF7)

