GD32-MCU-IOT/hal_gigadevice_zephyr/include/dt-bindings/pinctrl/gd32h759i(g-i-m)xx-pinctrl.h
/* UART6_RTS */
#define UART6_RTS_PE9 \
	GD32_PINMUX_AF('E', 9, AF7)
#define UART6_RTS_PF8 \
	GD32_PINMUX_AF('F', 8, AF7)

/* UART6_RX */
#define UART6_RX_PA8 \
	GD32_PINMUX_AF('A', 8, AF11)
#define UART6_RX_PB3 \
	GD32_PINMUX_AF('B', 3, AF11)
#define UART6_RX_PE7 \
	GD32_PINMUX_AF('E', 7, AF7)
#define UART6_RX_PF6 \
	GD32_PINMUX_AF('F', 6, AF7)

/* UART6_TX */
#define UART6_TX_PA15 \
	GD32_PINMUX_AF('A', 15, AF11)
#define UART6_TX_PB4 \
	GD32_PINMUX_AF('B', 4, AF11)
#define UART6_TX_PE8 \
	GD32_PINMUX_AF('E', 8, AF7)
#define UART6_TX_PF7 \
	GD32_PINMUX_AF('F', 7, AF7)

/* UART7_CTS */
#define UART7_CTS_PD14 \
	GD32_PINMUX_AF('D', 14, AF8)

/* UART7_DE */
#define UART7_DE_PD15 \
	GD32_PINMUX_AF('D', 15, AF8)

/* UART7_RTS */
#define UART7_RTS_PD15 \
	GD32_PINMUX_AF('D', 15, AF8)

/* UART7_RX */
#define UART7_RX_PE0 \
	GD32_PINMUX_AF('E', 0, AF8)
#define UART7_RX_PJ9 \
	GD32_PINMUX_AF('J', 9, AF8)

/* UART7_TX */
#define UART7_TX_PE1 \
	GD32_PINMUX_AF('E', 1, AF8)
#define UART7_TX_PJ8 \
	GD32_PINMUX_AF('J', 8, AF8)

/* USART0_CK */
#define USART0_CK_PA8 \
	GD32_PINMUX_AF('A', 8, AF7)

/* USART0_CTS */
#define USART0_CTS_PA13 \
	GD32_PINMUX_AF('A', 13, AF7)

/* USART0_DE */
#define USART0_DE_PA14 \
	GD32_PINMUX_AF('A', 14, AF7)

/* USART0_RTS */
#define USART0_RTS_PA14 \
	GD32_PINMUX_AF('A', 14, AF7)

/* USART0_RX */
#define USART0_RX_PA10 \
	GD32_PINMUX_AF('A', 10, AF7)
#define USART0_RX_PB7 \
	GD32_PINMUX_AF('B', 7, AF7)
#define USART0_RX_PF5 \
	GD32_PINMUX_AF('F', 5, AF4)

/* USART0_TX */
#define USART0_TX_PA9 \
	GD32_PINMUX_AF('A', 9, AF7)
#define USART0_TX_PB6 \
	GD32_PINMUX_AF('B', 6, AF7)
#define USART0_TX_PF4 \
	GD32_PINMUX_AF('F', 4, AF4)

/* USART1_CK */
#define USART1_CK_PA4 \
	GD32_PINMUX_AF('A', 4, AF7)
#define USART1_CK_PD7 \
	GD32_PINMUX_AF('D', 7, AF7)

/* USART1_CTS */
#define USART1_CTS_PA0 \
	GD32_PINMUX_AF('A', 0, AF7)
#define USART1_CTS_PD3 \
	GD32_PINMUX_AF('D', 3, AF7)

/* USART1_DE */
#define USART1_DE_PA1 \
	GD32_PINMUX_AF('A', 1, AF7)
#define USART1_DE_PD4 \
	GD32_PINMUX_AF('D', 4, AF7)

/* USART1_RTS */
#define USART1_RTS_PA1 \
	GD32_PINMUX_AF('A', 1, AF7)
#define USART1_RTS_PD4 \
	GD32_PINMUX_AF('D', 4, AF7)

/* USART1_RX */
#define USART1_RX_PA3 \
	GD32_PINMUX_AF('A', 3, AF7)
#define USART1_RX_PD6 \
	GD32_PINMUX_AF('D', 6, AF7)

/* USART1_TX */
#define USART1_TX_PA2 \
	GD32_PINMUX_AF('A', 2, AF7)
#define USART1_TX_PD5 \
	GD32_PINMUX_AF('D', 5, AF7)

/* USART2_CK */
#define USART2_CK_PB12 \
	GD32_PINMUX_AF('B', 12, AF7)
#define USART2_CK_PC12 \
	GD32_PINMUX_AF('C', 12, AF7)
#define USART2_CK_PD10 \
	GD32_PINMUX_AF('D', 10, AF7)

/* USART2_CTS */
#define USART2_CTS_PB13 \
	GD32_PINMUX_AF('B', 13, AF7)
#define USART2_CTS_PD11 \
	GD32_PINMUX_AF('D', 11, AF7)

/* USART2_DE */
#define USART2_DE_PD12 \
	GD32_PINMUX_AF('D', 12, AF7)
#define USART2_DE_PF4 \
	GD32_PINMUX_AF('F', 4, AF7)

/* USART2_RTS */
#define USART2_RTS_PD12 \
	GD32_PINMUX_AF('D', 12, AF7)
#define USART2_RTS_PF4 \
	GD32_PINMUX_AF('F', 4, AF7)

/* USART2_RX */
#define USART2_RX_PB11 \
	GD32_PINMUX_AF('B', 11, AF7)
#define USART2_RX_PC11 \
	GD32_PINMUX_AF('C', 11, AF7)
#define USART2_RX_PD9 \
	GD32_PINMUX_AF('D', 9, AF7)

/* USART2_TX */
#define USART2_TX_PB10 \
	GD32_PINMUX_AF('B', 10, AF7)
#define USART2_TX_PC10 \
	GD32_PINMUX_AF('C', 10, AF7)
#define USART2_TX_PD8 \
	GD32_PINMUX_AF('D', 8, AF7)

/* USART5_CK */
#define USART5_CK_PC8 \
	GD32_PINMUX_AF('C', 8, AF7)
#define USART5_CK_PG7 \
	GD32_PINMUX_AF('G', 7, AF7)

/* USART5_CTS */
#define USART5_CTS_PG13 \
	GD32_PINMUX_AF('G', 13, AF7)
#define USART5_CTS_PG15 \
	GD32_PINMUX_AF('G', 15, AF7)

/* USART5_DE */
#define USART5_DE_PG8 \
	GD32_PINMUX_AF('G', 8, AF7)
#define USART5_DE_PG12 \
	GD32_PINMUX_AF('G', 12, AF7)

/* USART5_RTS */
#define USART5_RTS_PG8 \
	GD32_PINMUX_AF('G', 8, AF7)
#define USART5_RTS_PG12 \
	GD32_PINMUX_AF('G', 12, AF7)

/* USART5_RX */
#define USART5_RX_PC7 \
	GD32_PINMUX_AF('C', 7, AF7)
#define USART5_RX_PG9 \
	GD32_PINMUX_AF('G', 9, AF7)

/* USART5_TX */
#define USART5_TX_PC6 \
	GD32_PINMUX_AF('C', 6, AF7)
#define USART5_TX_PG14 \
	GD32_PINMUX_AF('G', 14, AF7)

/* USBHS0_ID */
#define USBHS0_ID_PA10 \
	GD32_PINMUX_AF('A', 10, AF10)

/* USBHS0_SOF */
#define USBHS0_SOF_PA8 \
	GD32_PINMUX_AF('A', 8, AF10)

/* USBHS0_ULPI_CK */
#define USBHS0_ULPI_CK_PA5 \
	GD32_PINMUX_AF('A', 5, AF10)

/* USBHS0_ULPI_D0 */
#define USBHS0_ULPI_D0_PA3 \
	GD32_PINMUX_AF('A', 3, AF10)

/* USBHS0_ULPI_D1 */
#define USBHS0_ULPI_D1_PB0 \
	GD32_PINMUX_AF('B', 0, AF10)

/* USBHS0_ULPI_D2 */
#define USBHS0_ULPI_D2_PB1 \
	GD32_PINMUX_AF('B', 1, AF10)

/* USBHS0_ULPI_D3 */
#define USBHS0_ULPI_D3_PB10 \
	GD32_PINMUX_AF('B', 10, AF10)

/* USBHS0_ULPI_D4 */
#define USBHS0_ULPI_D4_PB11 \
	GD32_PINMUX_AF('B', 11, AF10)
#define USBHS0_ULPI_D4_PF0 \
	GD32_PINMUX_AF('F', 0, AF5)

/* USBHS0_ULPI_D5 */
#define USBHS0_ULPI_D5_PB12 \
	GD32_PINMUX_AF('B', 12, AF10)
#define USBHS0_ULPI_D5_PF1 \
	GD32_PINMUX_AF('F', 1, AF5)

/* USBHS0_ULPI_D6 */
#define USBHS0_ULPI_D6_PB13 \
	GD32_PINMUX_AF('B', 13, AF10)
#define USBHS0_ULPI_D6_PF2 \
	GD32_PINMUX_AF('F', 2, AF5)

/* USBHS0_ULPI_D7 */
#define USBHS0_ULPI_D7_PB5 \
	GD32_PINMUX_AF('B', 5, AF10)

/* USBHS0_ULPI_DIR */
#define USBHS0_ULPI_DIR_PC2 \
	GD32_PINMUX_AF('C', 2, AF10)

/* USBHS0_ULPI_NXT */
#define USBHS0_ULPI_NXT_PC3 \
	GD32_PINMUX_AF('C', 3, AF10)
#define USBHS0_ULPI_NXT_PH4 \
	GD32_PINMUX_AF('H', 4, AF10)

/* USBHS0_ULPI_STP */
#define USBHS0_ULPI_STP_PC0 \
	GD32_PINMUX_AF('C', 0, AF10)

/* USBHS1_ID */
#define USBHS1_ID_PB13 \
	GD32_PINMUX_AF('B', 13, AF8)

/* USBHS1_SOF */
#define USBHS1_SOF_PB11 \
	GD32_PINMUX_AF('B', 11, AF12)

/* USBHS1_ULPI_CK */
#define USBHS1_ULPI_CK_PH5 \
	GD32_PINMUX_AF('H', 5, AF8)
#define USBHS1_ULPI_CK_PJ11 \
	GD32_PINMUX_AF('J', 11, AF7)

/* USBHS1_ULPI_D0 */
#define USBHS1_ULPI_D0_PH6 \
	GD32_PINMUX_AF('H', 6, AF8)
#define USBHS1_ULPI_D0_PK0 \
	GD32_PINMUX_AF('K', 0, AF7)

/* USBHS1_ULPI_D1 */
#define USBHS1_ULPI_D1_PH7 \
	GD32_PINMUX_AF('H', 7, AF8)
#define USBHS1_ULPI_D1_PK1 \
	GD32_PINMUX_AF('K', 1, AF7)

/* USBHS1_ULPI_D2 */
#define USBHS1_ULPI_D2_PH8 \
	GD32_PINMUX_AF('H', 8, AF8)
#define USBHS1_ULPI_D2_PK2 \
	GD32_PINMUX_AF('K', 2, AF7)

/* USBHS1_ULPI_D3 */
#define USBHS1_ULPI_D3_PG1 \
	GD32_PINMUX_AF('G', 1, AF8)
#define USBHS1_ULPI_D3_PH9 \
	GD32_PINMUX_AF('H', 9, AF8)

/* USBHS1_ULPI_D4 */
#define USBHS1_ULPI_D4_PG2 \
	GD32_PINMUX_AF('G', 2, AF8)
#define USBHS1_ULPI_D4_PH10 \
	GD32_PINMUX_AF('H', 10, AF8)

/* USBHS1_ULPI_D5 */
#define USBHS1_ULPI_D5_PG3 \
	GD32_PINMUX_AF('G', 3, AF8)
#define USBHS1_ULPI_D5_PH11 \
	GD32_PINMUX_AF('H', 11, AF8)

/* USBHS1_ULPI_D6 */
#define USBHS1_ULPI_D6_PG4 \
	GD32_PINMUX_AF('G', 4, AF8)
#define USBHS1_ULPI_D6_PH12 \
	GD32_PINMUX_AF('H', 12, AF8)

/* USBHS1_ULPI_D7 */
#define USBHS1_ULPI_D7_PG5 \
	GD32_PINMUX_AF('G', 5, AF8)

/* USBHS1_ULPI_DIR */
#define USBHS1_ULPI_DIR_PH3 \
	GD32_PINMUX_AF('H', 3, AF8)
#define USBHS1_ULPI_DIR_PJ9 \
	GD32_PINMUX_AF('J', 9, AF7)

/* USBHS1_ULPI_NXT */
#define USBHS1_ULPI_NXT_PH4 \
	GD32_PINMUX_AF('H', 4, AF8)
#define USBHS1_ULPI_NXT_PJ10 \
	GD32_PINMUX_AF('J', 10, AF7)

/* USBHS1_ULPI_STP */
#define USBHS1_ULPI_STP_PH2 \
	GD32_PINMUX_AF('H', 2, AF8)
#define USBHS1_ULPI_STP_PJ8 \
	GD32_PINMUX_AF('J', 8, AF7)
